Repository: stride3d/stride
Catalog: sources/localization/*/Stride.Core.Assets.Editor.*.po
Languages: es, fr, ru

source: Included in build as dependency
es: Incluido en la compilación como dependencia
fr: Inclus comme dépendance dans la compilation
ru: Включено в сборку как зависимость

source: Excluded from build
es: Excluidos de la construcción
fr: Exclus de la compilation
ru: Не включено в сборку

# ToolTip
source: Add an asset to this location
es: Añadir un asset a esta ubicación
fr: Ajouter une ressource à cet emplacement
ru: Добавить актив в это расположение

source: Add asset
es: Añadir asset
fr: Ajouter une ressource
ru: Добавить актив

# ToolTip
source: Update assets whose source files have changed
es: Actualización de los assets con origen cambiado
fr: Mettre à jour les ressources pour lesquelles les fichiers sources ont été modifiés
ru: Обновление ресурсов, исходные файлы которых изменились

# ToolTip
source: Import last effects compiled remotely
es: Importación de los últimos efectos compilados remotamente
fr: Importer les derniers effets compilés à distance
ru: Импорт последних эффектов, скомпилированных удаленно

# ToolTip
source: Open asset in dedicated editor
es: Abrir un asset en un editor dedicado
fr: Ouvrir la ressource dans l'éditeur dédié
ru: Редактировать

# ToolTip
source: Asset view options
es: Opciones de vista del asset
fr: Options de la vue des ressources
ru: Настройки просмотра активов

# Menu
source: Display
es: Vista
fr: Affichage
ru: Показывать

# Menu
source: Assets in selected folder only
es: Assets sólo en el directorio seleccionado
fr: Ressources dans le dossier sélectionné uniquement
ru: Только активы в выбранной папке

# Menu
source: Assets and folders in selected folder
es: Assets y directorios en el directorio seleccionado
fr: Ressources et dossiers dans le dossier sélectionné
ru: Активы и папки в выбранной директории

# Menu
source: Assets in selected folder and subfolders
es: Assets en los directorios y subdirectorios
fr: Ressources dans le dossier sélectionné et ses sous-dossiers
ru: Активы в выбранной и во вложенных в неё папках

# Menu
source: Name
es: Nombre
fr: Nom
ru: Имя

# Menu
source: Date modified
es: Fecha de modificación
fr: Date de modification
ru: Дата изменения

# Menu
source: Type
es: Tipo
ru: Тип

# Menu
source: Unsaved changes
es: Cambios no guardados
fr: Modifications non enregistrées
ru: Несохраненные изменения

# ToolTip
source: Zoom in
es: Zoom
fr: Zoom avant
ru: Увеличить

# ToolTip
source: Zoom out
es: Zoom de alejamiento
fr: Zoom arrière
ru: Уменьшить

# Menu
source: Tiles
es: Secciones
fr: Tuiles
ru: Эскизы

source: Add a filter...
es: Agregar un filtro...
fr: Ajouter un filtre…
ru: Добавить фильтр...

source: Filter assets by name, type or tag
es: Filtrar assets por nombre, tipo o etiqueta
fr: Filtrer les ressources par nom, type ou étiquette
ru: Фильтр активов по имени, типу или тэгу

# ToolTip
source: Clear filters
es: Limpiar filtros
fr: Effacer les filtres
ru: Сбросить фильтры

source: No asset to display in this folder or no folder selected. Check your active filters.
es: No hay ningún asset que mostrar en este directorio o no hay ningun directorio seleccionado. Compruebe sus filtros activos.
fr: Aucune ressource à afficher dans ce dossier ou aucun dossier sélectionné. Vérifiez vos filtres actifs.
ru: Нет ресурсов для отображения в этой папке или папка не выбрана. Проверьте фильтр поиска активов.

source: You can also drop files here to import assets.
es: También puede arrastrar archivos aquí para importar assets.
fr: Vous pouvez aussi glisser-déposer des fichiers ici pour importer des ressources.
ru: Вы также можете перетащите сюда файлы для импорта активов.

# ToolTip
source: Add...
es: Añadir...
fr: Ajouter…
ru: Добавить...

# ToolTip
source: Replace...
es: Reemplazar....
fr: Remplacer…
ru: Заменить...

# ToolTip
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

source: List
es: Lista
fr: Liste
ru: Список

source: {0} item
es: {0} elemento
fr: {0} élément
ru: {0} предмет

source: Add to {0}
es: Añadir a {0}
fr: Ajouter à {0}
ru: Добавить в {0}

# ToolTip
source: Add a new entry to the dictionary
es: Agregar una nueva entrada al Diccionario
fr: Ajouter une nouvelle entrée dans le dictionnaire
ru: Добавить новую запись в словарь

source: Dictionary
es: Diccionario
fr: Dictionnaire
ru: Словарь

source: Key name:
es: Nombre de clave:
fr: Nom de clé :
ru: Ключ:

source: New key
es: Nueva clave
fr: Nouvelle clé
ru: Новый ключ

# ToolTIp
source: Character
es: Personaje
fr: Caractère
ru: Персонаж

# ToolTip
source: Unicode value
es: Valor Unicode
fr: Valeur unicode
ru: значение Unicode

# ToolTip
source: Angle in degrees
es: Ángulo en grados
fr: Angle en degrés
ru: Угол в градусах

# ToolTip
source: Browse directory
es: Examinar directorio
fr: Parcourir
ru: Выбрать каталог

# ToolTip
source: Browse file
es: Examinar archivo
fr: Parcourir
ru: Посмотреть файл

# Button
source: Change values...
es: Modificar valores....
fr: Modifier les valeurs…
ru: Изменение значений...

# Button
source: All
es: todo
fr: Tout
ru: Все

# ToolTip
source: Select all values
es: Seleccione todos los valores
fr: Sélectionner toutes les valeurs
ru: Выбрать все значения

# Button
source: None
es: Ninguno
fr: Aucun
ru: Нет

# ToolTip
source: Clear selection
es: Deseleccionar
fr: Effacer la sélection
ru: Очистить выделенное

# Button
source: Invert
es: Invertir
fr: Inverser
ru: Инвертировать

# ToolTip
source: Invert selection
es: Invertir selección
fr: Inverser la sélection
ru: Инвертировать выделение

source: Select the referenced asset
es: Seleccione el asset que se hace referencia
fr: Sélectionner la ressource référencée
ru: Выбрать указанный актив

source: Clear this reference
es: Limpiar esta referencia
fr: Effacer cette référence
ru: Очистить эту ссылку

# ToolTip
source: Select an asset
es: Seleccione un asset
fr: Sélectionner une ressource
ru: Выбрать актив

# ToolTip
source: Clear the reference
es: Limpiar la referencia
fr: Effacer la référence
ru: Очистить ссылку

# ToolTip
source: Select the referenced asset
es: Seleccione el asset que se hace referencia
fr: Sélectionner la ressource référencée
ru: Выберите референсный актив

# ToolTip
source: Create an instance of this structure
es: Crear una instancia de esta estructura
fr: Créer une instance de cette structure
ru: Создать экземпляр этой структуры

# ToolTip
source: Clear value (set to null)
es: Borrar valor (establecido en null)
fr: Effacer la valeur (définir à null)
ru: Очистить значение (установить на ноль)

source: (null)
ru: (значение null)

source: Unable to load the object of type {0} from assembly {1}
es: No se puede cargar el objeto del tipo {0} desde el ensamblaje {1}
fr: Impossible de charger l'objet de type {0} depuis l'ensemble {1}
ru: Невозможно загрузить объект типа {0} из сборки {1}

source: Notification
es: Notificación
ru: Уведомление

source: Select a package
es: Seleccione un paquete
fr: Sélectionner un paquet
ru: Выбрать пакет

# ToolTip
source: Select this package
es: Seleccione este paquete
fr: Sélectionner ce paquet
ru: Выбрать этот пакет

source: Settings
es: Configuración
fr: Paramètres
ru: Настройки

# Button
source: Save and close
es: Guardar y cerrar
fr: Enregistrer et quitter
ru: Сохранить и закрыть

source: Operation completed.
es: Operación completada.
fr: Opération terminée.
ru: Операция завершена.

source: Operation failed.
es: Error en la operación.
fr: Échec de l'opération.
ru: Операция не удалась.

source: Operation cancelled.
es: Operación cancelada.
fr: Opération annulée.
ru: Операция отменена.

# Button
source: Close
es: Cerrar
fr: Fermer
ru: Закрыть

source: Add asset...
es: Añadir asset...
fr: Ajouter une ressource…
ru: Добавить актив...

source: out of {0} file(s)
es: de {0} archivo(s)
fr: restant sur {0} fichier(s)
ru: {0} из {0} файла(ов)

source: Fix references ({0})
es: Arreglar referencias ({0})
fr: Corriger les références ({0})
ru: Исправить ссылки ({0})

source: The asset {0} is referenced by other assets. Choose how to handle these references.
es: El asset {0} está referenciado por otros activos. Elija cómo gestionar estas referencias.
fr: La ressource {0} est référencée par d'autres ressources. Choisissez comment gérer ces références.
ru: На актив {0} ссылаются другие активы. Выберите, что делать с этими ссылками.

# Button
source: Replace all the references with a reference to a different asset:
es: Reemplace todas las referencias con una referencia a un asset diferente:
fr: Remplacer toutes les références avec une référence vers une ressource différente :
ru: Заменить все ссылки, ссылкой на другой актив:

# ToolTip
source: Select asset
es: Seleccionar asset
fr: Sélectionner une ressource
ru: Выбрать актив

source: Referencer
es: Referenciador
fr: Référencer
ru: Справочник

source: Replacement asset
es: Assets de reemplazo
fr: Ressource de remplacement
ru: Замена актива

# Button
source: Clear this reference
es: Limpiar esta referencia
fr: Effacer cette référence
ru: Очистить ссылку

# Button
source: Replace references individually:
es: Reemplazar las referencias individualmente:
fr: Remplacer les références individuellement :
ru: Заменить ссылки по отдельности:

# Button
source: Done
es: Hecho
fr: Terminé
ru: Готово

# Button
source: Clear references
es: Limpiar referencias
fr: Effacer les références
ru: Очистить ссылки

# ToolTip
source: Clear the references of the current asset
es: Limpiar las referencias del asset actual
fr: Effacer les références de la ressource courante
ru: Очистить ссылки на текущий актив

# Button
source: Clear all references
es: Limpiar todas las referencias
fr: Effacer toutes les références
ru: Очистить все ссылки

# ToolTip
source: Clear references for all assets being deleted
es: Limpiar las referencias para todos los assets en proceso de eliminación
fr: Effacer les références pour toutes les ressources supprimées
ru: Очистить ссылки на все удаляемые активы

# ToolTip
source: Cancel operation
es: Cancelar operación
fr: Annuler l'opération
ru: Отмена операции

source: Search
es: Buscar
fr: Rechercher
ru: Поиск

# ToolTip
source: Import directly from files
es: Importación directa desde archivos
fr: Importer directement à partir de fichiers
ru: Импорт напрямую из файлов

source: New package
es: Nuevo paquete
fr: Nouveau paquet
ru: Новый пакет

# Button
source: Select
es: Seleccionar
fr: Sélectionner
ru: Выбрать

# ToolTip
source: Use the selected template
es: Utilizar la plantilla seleccionada
fr: Utiliser le modèle sélectionné
ru: Использовать выбранный шаблон

source: Name:
es: Nombre:
fr: Nom :
ru: Имя:

source: Location:
es: Ubicación:
fr: Emplacement :
ru: Расположение:

# Button
source: Browse for existing project
es: Buscar proyecto existente
fr: Rechercher un projet existant
ru: Выбрать существующий проект

# Button
source: Reload last session automatically at startup
es: Recargar la última sesión automáticamente al iniciar
fr: Recharger automatiquement la dernière session au démarrage
ru: Загружать последнюю сессию при запуске

source: Solution name:
es: Nombre de la solución:
fr: Nom de la solution :
ru: Имя решения:

source: (Auto-generate solution name)
es: (Generar automáticamente el nombre de la solución)
fr: (Générer automatiquement le nom de la solution)
ru: (Автоматически генерировать имя решения)

source: Solution location:
es: Ubicación de la solución:
fr: Emplacement de la solution :
ru: Расположение решения:

source: (Same location)
es: (Mismo lugar)
fr: (Même emplacement)
ru: (В том же месте)

# Menu
source: Show in Explorer
es: Ver en el explorador de archivos
fr: Afficher dans l'explorateur
ru: Показать в проводнике

# Menu
source: Remove From List
es: Eliminar de la lista
fr: Supprimer de la liste
ru: Удалить из списка
