Repository: stride3d/stride
Catalog: sources/localization/*/Stride.GameStudio.*.po
Languages: es, fr, ru

# Message
source: An executable project must be set as current project in the session explorer in order to process build.
es: Un proyecto ejecutable debe establecerse como proyecto actual en el explorador de sesión para poder procesar la compilación.
fr: Un projet exécutable doit être défini comme projet courant dans l'explorateur de session pour pouvoir procéder à la compilation.
ru: Для сборки, исполняемый проект должен быть установлен в обозревателе как текущий.

# Message
source: Unable to launch {0} on host {1}
es: No se puede iniciar {0} en el host {1}
fr: Impossible de lancer {0} sur l'hôte {1}
ru: Не удается запустить {0} на host {1}

# Settings
source: Remote
es: Remoto
fr: Distant
ru: Удалённо

# Settings
source: Default session to load
es: Sesión predeterminada para cargar
fr: Session à charger par défaut
ru: Загружать по умолчанию

# Settings
source: Port
es: Puerto

# Settings
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
ru: Имя пользователя

# Settings
source: Password
es: Contraseña
fr: Mot de passe
ru: Пароль

# Settings
source: Location
es: Ubicación
fr: Emplacement
ru: Расположение

# Settings
source: Ask for credentials when deploying game
es: Solicitar las credenciales cuando se despliega el juego
fr: Demander les identifiants lors du déploiement du jeu
ru: Запросить учетные данные при запуске игры

# Settings
source: X Display
es: Display X
fr: Écran X
ru: Определение дисплея, где будет запущена игра

# Credentials
source: Your credentials are correct.
es: Sus credenciales son correctas.
fr: Vos identifiants sont corrects.
ru: Данные введены верно.

# Credentials
source: Couldn't reach the specified host.
es: El host no se ha encontrado.
fr: Impossible d'atteindre l'hôte spécifié.
ru: Не удалось связаться с указанным узлом (host).

# Credentials
source: Invalid credentials.
es: Credenciales incorrectas.
fr: Identifiants incorrects.
ru: Неверные учетные данные.

# Credentials
source: The location you specified doesn't exist.
es: La ubicación especificada no existe.
fr: L'emplacement que vous avez spécifié n'existe pas.
ru: Указанное расположение не существует.

# Credentials
source: An unknown error occurred.
es: Error desconocido.
fr: Une erreur inconnue s'est produite.
ru: Произошла неизвестная ошибка.

# Message
source: To reset the layout, Game Studio needs to close and re-open all asset and document editors. You won't lose unsaved changes.
es: Para restablecer el diseño, Game Studio necesita cerrar y volver a abrir todos los editores de assets y documentos. No perderá los cambios no guardados.
fr: Pour réinitialiser la disposition, Game Studio à besoin de fermer et de rouvrir tous les éditeurs de ressource et de document. Vous ne perdrez pas vos modifications non enregistrées.
ru: Чтобы сбросить макет, Game Studio необходимо закрыть и заново открыть все активы и редакторы документов. Изменения не будут утеряны.

# Title
source: Output
es: Salida
fr: Sortie
ru: Лог действий

# Message
source: Some game code files have been modified. Do you want to reload the assemblies?
es: Algunos archivos han sido modificados. ¿Desea recargar los ensamblados?
fr: Certains fichiers de code du jeu ont été modifiés. Voulez-vous recharger les ensembles ?
ru: Некоторые файлы были изменены. Собрать заново ?

# Button
source: Reload
es: Recargar
fr: Recharger
ru: Перезапуск

# Button
source: Don't reload
es: No recargar
fr: Ne pas recharger
ru: Не перезапускать

# Message
source: Platform {0} isn't supported for execution.
es: No está soportada la plataforma {0} para ejecución.
fr: La plateforme {0} n'est pas prise en charge pour l'exécution.
ru: Платформа {0} не поддерживается.

# Message
source: No Android device found for execution.
es: No se ha encontrado ningún dispositivo Android para su ejecución.
fr: Aucun appareil Android trouvé pour l'exécution.
ru: Исполняющее Android-устройство не найдено.

# Message
source: Unable to load and compile project {0}
es: Imposible cargar y compilar el proyecto {0}
fr: Impossible de charger et compiler le projet {0}
ru: Невозможно загрузить и скомпилировать проект {0}

# Message
source: Unable to reach to output executable: {0}
es: No se ha encontrado el ejecutable generado: {0}
fr: Impossible d’atteindre la sortie exécutable : {0}
ru: Не найден исполняемый файл: {0}

# Message
source: Couldn't find Android package name for {0}.
es: No se ha encontrado el paquete de Android para {0}.
fr: Impossible de trouver le nom du paquet Android pour {0}.
ru: Не найден пакет {0} для Android.

# Message
source: Android tool ""adb"" couldn't found (no running process, in registry or on the PATH). Please add it to your PATH.
es: La herramienta ""adb"" de Android no se ha encontrado (ningún proceso en ejecución, en el registro o en el PATH). Por favor agrégala a tu PATH.
fr: L’outil Android « adb » n’a pas pu être trouvé (pas de processus en cours d’exécution, dans le registre ou sur le PATH). Veuillez l’ajouter à votre PATH.
ru: Утилита ""adb"" для Android не найдена. (либо её нет, либо она не запущена) Проверьте путь.

# Message
source: Can't run Android app with adb: {0}
es: No se puede ejecutar la aplicación de Android con adb: {0}
fr: Impossible de lancer l'application Android avec adb : {0}
ru: Не удалось запустить Android-приложение с adb: {0}

# Message
source: No credentials provided. To allow deployment, add your credentials.
es: No se han proporcionado credenciales. Para permitir el despliegue, agregue sus credenciales.
fr: Pas d'identifiants fournis. Pour autoriser le déploiement, ajoutez vos identifiants.
ru: Не введены учетные данные. Чтобы разрешить выполнение, укажите учетные данные.

# Message
source: Unable to launch project {0}
es: No se ha podido iniciar el proyecto {0}
fr: Impossible de lancer le projet {0}
ru: Не удается запустить проект {0}

# Message
source: Deployment of {0} successful.
es: El despliegue de {0} ha sido un éxito.
fr: Déploiement de {0} réussi.
ru: {0} успешно выполнено.

# Message
source: An exception occurred while compiling the project: {0}
es: Se ha producido una excepción al compilar el proyecto: {0}
fr: Une erreur s'est produite pendant la compilation du projet : {0}
ru: Ошибка при компиляции проекта: {0}

# Message
source: To process the build, set an executable project as the current project in the session explorer.
es: Para procesar la compilación, establezca un proyecto ejecutable como proyecto actual en el explorador de sesión.
fr: Pour procéder à la compilation, définissez un projet exécutable comme étant le projet courant dans l'explorateur de session.
ru: Для сборки проекта, задайте в обозревателе данный проект как текущий.

# Message
source: To build, save the project first.
es: Para compilar, guarde el proyecto primero.
fr: Pour compiler, enregistrez d'abord le projet.
ru: Перед сборкой, проект необходимо сохранить.

# Message
source: The file {0} does not exist.
es: El archivo {0} no existe.
fr: Le fichier {0} n'existe pas.
ru: Файл {0} не существует.

# About
source: About Stride
es: Acerca de Stride
fr: À propos de Stride
ru: о Stride

# About
source: Stride version
es: Versión de Stride
fr: Version de Stride
ru: Версия Stride

# About
source: MIT License
es: Licencia MIT
fr: Licence MIT
ru: Лицензия MIT

# About
source: Stride uses open-source software
es: Stride utiliza software de código abierto
fr: Stride utilise des logiciels libres
ru: Stride использует открытый исходный код

# About
source: See the list
es: Ver la lista
fr: Voir la liste
ru: Посмотреть список

# About
source: Privacy policy
es: Política de privacidad
fr: Politique de confidentialité
ru: Политика конфиденциальности

# About
source: Close
es: Cerrar
fr: Fermer
ru: Закрыть

source: Credentials
es: Credenciales
fr: Identifiants
ru: Учетные данные

# Credentials
source: Provide information about the host to connect to. Your password is encrypted on this machine.
es: Proporcionar información sobre el host al que conectarse. Su contraseña está encriptada en este equipo.
fr: Fournit des informations sur l'hôte auquel se connecter. Votre mot de passe est crypté sur cette machine.
ru: Предоставьте информацию об узле(host), к которому необходимо подключиться. Ваш пароль на этой машине зашифрован.

# Credentials
source: Port
es: Puerto

# Credentials
source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
ru: Имя пользователя

# Credentials
source: Password
es: Contraseña
fr: Mot de passe
ru: Пароль

# Credentials
source: Location
es: Ubicación
fr: Emplacement
ru: Расположение

# Credentials
source: Don't ask again
es: No volver a preguntar
fr: Ne plus demander
ru: Не напоминать

# Credentials
source: Test settings
es: Configuración de la prueba
fr: Tester les paramètres
ru: Тестовые настройки

# Button
source: Save
es: Guardar
fr: Enregistrer
ru: Сохранить

# Button
source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

# Menu
source: Edit asset...
es: Editar asset...
fr: Modifier la ressource…
ru: Редактировать актив...

# Menu
source: Don't include in build as root asset
es: No incluir en la compilación como asset raíz
fr: Ne pas inclure dans la compilation en tant que ressource racine
ru: Не включать в сборку как корневой ресурс

# Menu
source: Include in build as root asset
es: Incluir en la compilación como asset raíz
fr: Inclure dans la compilation en tant que ressource racine
ru: Включить в сборку как корневой ресурс

# Menu
source: Cut
es: Cortar
fr: Couper
ru: Вырезать

# Menu
source: Copy
es: Copiar
fr: Copier
ru: Копировать

# Menu
source: Copy with dependencies
es: Copiar con dependencias
fr: Copier avec les dépendances
ru: Копировать с зависимостями

# Menu
source: Paste
es: Pegar
fr: Coller
ru: Вставить

# Menu
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

# Menu
source: Copy asset URL
es: Copiar la URL del asset
fr: Copier l'URL de la ressource
ru: Копировать путь актива

# Menu
source: Rename
es: Renombrar
fr: Renommer
ru: Переименовать

# Menu
source: Create folder
es: Crear directorio
fr: Créer un dossier
ru: Создать папку

# Menu
source: Add asset...
es: Añadir asset...
fr: Ajouter une ressource…
ru: Добавить актив..

# Menu
source: Update selected assets from their source
es: Actualizar los assets seleccionados desde su origen
fr: Mettre à jour les ressources sélectionnées depuis leur source
ru: Обновить выбранные активы из источника

# Menu
source: Update all assets with modified source
es: Actualizar todos los assets con origen modificado
fr: Mettre à jour toutes les ressources avec une source modifiée
ru: Обновить все активы с измененным источником

# Menu
source: Explore
es: Explorar
fr: Explorer
ru: Проводник

# Menu
source: Open with text editor
es: Abrir con el editor de texto
fr: Ouvrir avec l'éditeur de texte
ru: Открыть в текстовом редакторе

# Menu
source: Open asset file
es: Abrir asset
fr: Ouvrir le fichier de ressource
ru: Открыть актив

# Menu
source: Open source file
es: Abrir archivo de codigo fuente
fr: Ouvrir le fichier source
ru: Открыть исходный файл

# Menu
source: Show in Explorer
es: Ver en el explorador de archivos
fr: Afficher dans l'explorateur
ru: Показать в проводнике

# Menu
source: File
es: Archivo
fr: Fichier
ru: Файл

# Menu
source: New
es: Nuevo
fr: Nouveau
ru: Новый

# Menu
source: Open
es: Abrir
fr: Ouvrir
ru: Открыть

# Menu
source: Open recent
es: Abrir recientes
fr: Ouvrir récent
ru: Открыть недавние

# Menu
source: Clear list
es: Limpiar lista
fr: Effacer la liste
ru: Очистить недавние

# Menu
source: Save
es: Guardar
fr: Enregistrer
ru: Сохранить

# Menu
source: Reload project
es: Recargar proyecto
fr: Recharger le projet
ru: Перезапустить проект

# Menu
source: Quit
es: Salir
fr: Quitter
ru: Выход

# Menu
source: Edit
es: Editar
fr: Édition
ru: Редактировать

# Menu
source: Undo
es: Deshacer
fr: Annuler
ru: Отменить

# Menu
source: Redo
es: Rehacer
fr: Rétablir
ru: Вернуть

# Menu
source: Settings
es: Configuración
fr: Paramètres
ru: Настройки

# Menu
source: Project
es: Proyecto
fr: Projet
ru: Проект

# Menu
source: Build project
es: Compilar el proyecto
fr: Compiler le projet
ru: Собрать проект

# Menu
source: Start project
es: Iniciar proyecto
fr: Démarrer le projet
ru: Запустить проект

# Menu
source: Start live-scripting
es: Iniciar live-scripting
fr: Démarrer le live-scripting
ru: Запустить "живой скрипт"

# Menu
source: Cancel build
es: Cancelar compilación
fr: Annuler la compilation
ru: Отменить сборку

# Menu
source: Folder
es: Directorio
fr: Dossier
ru: Папка

# Menu
source: Package
es: Paquete
fr: Paquet
ru: Пакет

# Menu
source: Update package
es: Actualizar paquete
fr: Mettre à jour le paquet
ru: Обновить пакет

# Menu
source: Add dependency...
es: Añadir dependencia...
fr: Ajouter une dépendance…
ru: Добавить зависимости...

# Menu
source: Set as current project
es: Establecer como proyecto actual
fr: Définir comme projet courant
ru: Выбрать как текущий проект

# Menu
source: Package properties
es: Propiedades del paquete
fr: Propriétés du paquet
ru: Свойства пакета

# Menu
source: Solution
es: Solución
ru: Решение

# Menu
source: New project...
es: Nuevo proyecto...
fr: Nouveau projet…
ru: Новый проект...

# Menu
source: Add existing project...
es: Añadir proyecto existente...
fr: Ajouter un projet existant…
ru: Добавить существующий проект...

# Menu
source: Open in IDE
es: Abrir en el IDE
fr: Ouvrir dans l'EDI
ru: Открыть в IDE

# Menu
source: Reload game assemblies
es: Recargar los ensamblados del juego
fr: Recharger les ensembles de jeu
ru: Перезапустить сборку игры

# Menu
source: Actions
es: Acciones
ru: Действие

# Menu
source: View
es: Ver
fr: Vue
ru: Вид

# Menu
source: Solution explorer
es: Explorador de soluciones
fr: Explorateur de solution
ru: Обозреватель решений

# Menu
source: Asset view
es: Ver asset
fr: Vue des ressources
ru: Обзор актива

# Menu
source: References
es: Referencias
fr: Références
ru: Ссылки

# Menu
source: Asset preview
es: Previsualización de assets
fr: Aperçu des ressources
ru: Пред.просмотр активов

# Menu
source: Property grid
es: Cuadrícula de propiedades
fr: Grille des propriétés
ru: Окно свойств

# Menu
source: Edit history
es: Historial de edición
fr: Modifier l'historique
ru: История изменений

# Menu
source: Asset errors
es: Error en los assets
fr: Erreurs de ressource
ru: Ошибки активов

# Menu
source: Output
es: Salida
fr: Sortie
ru: Лог действий

# Menu
source: Help
es: Ayuda
fr: Aide
ru: Помощь

# Menu
source: Online documentation
es: Documentación en línea
fr: Documentation en ligne
ru: Online документация

# Menu
source: Questions and answers
es: Preguntas y respuestas
fr: Questions et réponses
ru: Вопросы и ответы

# Menu
source: Report an issue...
es: Informar de un problema...
fr: Signaler un problème…
ru: Сообщить о проблеме...

# Menu
source: Community forums
es: Foros
fr: Forums communautaires
ru: Форум сообщества

# Menu
source: Show debug window
es: Mostrar ventana de depuración
fr: Afficher la fenêtre de déboguage
ru: Показать окно отладки

# Menu
source: About...
es: Acerca de...
fr: À propos...
ru: О нас...

# ToolTip
source: Create a project
es: Crear un proyecto
fr: Créer un projet
ru: Создать проект

# ToolTip
source: Open an existing project
es: Abrir un proyecto existente
fr: Ouvrir un projet existant
ru: Открыть существующий проект

# ToolTip
source: Open recent
es: Abrir recientes
fr: Ouvrir récent
ru: Открыть недавние

# ToolTip
source: Save the project and all its documents
es: Guardar el proyecto y todos sus documentos
fr: Enregistrer le projet et tous ses documents
ru: Сохранить проект и все документы

# ToolTip
source: Reload current project (ask to save)
es: Recargar proyecto actual (Preguntar antes de guardar)
fr: Recharger le projet courant (demander pour enregistrer)
ru: Перезапуск текущего проекта (необходимо сохранить)

# ToolTip
source: Undo last action
es: Deshacer la acción anterior
fr: Annuler la dernière action
ru: Отмена действия

# ToolTip
source: Redo last cancelled action
es: Rehacer la anterior acción cancelada
fr: Rétablir la dernière action annulée
ru: Вернуть отменённое действие

# ToolTip
source: Open in IDE
es: Abrir en el IDE
fr: Ouvrir dans l'éditeur
ru: Открыть в IDE

# ToolTip
source: Open with...
es: Abrir con...
fr: Ouvrir avec…
ru: Открыть с...

# ToolTip
source: Reload game assemblies and update scripts
es: Recargue los ensamblados del juego y actualice los scripts
fr: Recharger les ensembles de jeu et mettre à jour les scripts
ru: Обновить скрипты и перезапустить сборку

# ToolTip
source: Build the project
es: Compilar el proyecto
fr: Compiler le projet
ru: Собрать проект

# ToolTip
source: Build the project and start the game
es: Compilar el proyecto e iniciar el juego
fr: Compiler le projet et démarrer le jeu
ru: Собрать проект и запустить игру

# ToolTip
source: Start project in live-scripting mode
es: Iniciar proyecto en modo live-scripting
fr: Démarrer le projet en mode live-scripting
ru: Запуск проекта с "живым скриптом"

# ToolTip
source: Cancel the current build
es: Cancelar la compilación actual
fr: Annuler la compilation en cours
ru: Отменить текущую сборку

# View
source: Solution explorer
es: Explorador de soluciones
fr: Explorateur de solution
ru: Обозреватель решений

# ToolTip
source: Create a project...
es: Crear un proyecto...
fr: Créer un projet…
ru: Создать новый проект.

# ToolTip
source: Create a folder
es: Crear un directorio
fr: Créer un dossier
ru: Создать новую папку

# ToolTip
source: Display the properties of the selected package in the property grid
es: Mostrar las propiedades del paquete seleccionado en la cuadrícula de propiedades
fr: Afficher les propriétés des paquets sélectionnés dans la grille des propriétés
ru: Отображение свойств выбранного пакета в окне свойств

# ToolTip
source: Rename the selected folder or package
es: Cambiar el nombre del directorio o paquete seleccionado
fr: Renommer le dossier ou paquet sélectionné
ru: Переименовать выбранную папку или пакет

# ToolTip
source: Delete the selected items
es: Eliminar los elementos seleccionados
fr: Supprimer les éléments sélectionnés
ru: Удалить выбранные элементы

# ToolTip
source: Expand all asset folders
es: Expandir todos los directorios de assets
fr: Étendre tous les dossiers de ressource
ru: Развернуть все папки активов

# ToolTip
source: Expand all
es: Expandir todo
fr: Étendre tout
ru: Развернуть всё

# ToolTip
source: Collapse all
es: Contraer todo
fr: Réduire tout
ru: Свернуть всё

# ToolTip
source: Show in Explorer
es: Ver en el explorador de archivos
fr: Afficher dans l'explorateur
ru: Показать в проводнике

# View
source: Asset view
es: Ver asset
fr: Vue des ressources
ru: Обзор активов

# View
source: References
es: Referencias
fr: Références
ru: Ссылки

source: References
es: Referencias
fr: Références
ru: Ссылки

source: Referenced by
es: Hace referencia a
fr: Référencé par
ru: Ссылка на

# View
source: Asset error ({0})
es: Error en el asset ({0})
fr: Erreur de ressource ({0})
ru: Ошибка актива ({0})

source: Build
es: Compilar
fr: Compiler
ru: Собрать

source: Live-scripting
es: Iniciar proyecto en modo live-scripting
ru: "Живой скрипт"

# View
source: Property grid
es: Cuadrícula de propiedades
fr: Grille de propriétés
ru: Окно свойств

source: Add new tag
es: Añadir nueva etiqueta
fr: Ajouter une nouvelle étiquette
ru: Добавить новый тэг

# ToolTip
source: Previous selection
es: Selección anterior
fr: Sélection précédente
ru: Предыдущий

# ToolTip
source: Next selection
es: Selección siguiente
fr: Sélection suivante
ru: Следующий

# ToolTip
source: Add tag to all
es: Agregar etiqueta a todos
fr: Ajouter une étiquette à tous
ru: Добавить тэг ко всем

source: Open this asset in editor
es: Abrir este asset en el editor
fr: Ouvrir cette ressource dans l'éditeur
ru: Редактировать

source: Show this asset in editor
es: Ver este asset en el editor
fr: Afficher cette ressource dans l'éditeur
ru: Редактировать

# ToolTip
source: Display only overridden properties
es: Mostrar sólo las propiedades sustituidas
fr: Afficher uniquement les propriétés remplacées
ru: Отображать только изменённые свойства

source: Search properties
es: Buscar propiedades
fr: Rechercher des propriétés
ru: Настройки поиска

# Menu
source: Reset to base value
es: Restablecer al valor base
fr: Réinitialiser à la valeur par défaut
ru: Сброс к значению по умолчанию

# View
source: Asset preview
es: Vista previa del asset
fr: Prévisualisation de ressource
ru: Пред.просмотр активов

# View
source: Edit history
es: Historial de edición
fr: Modifier l'historique
ru: История изменений

# StatusBar
source: {0} item
es: {0} elemento
fr: {0} élément
ru: {0} предмет

# StatusBar
source: ({0} selected)
es: ({0} seleccionado)
fr: ({0}) sélectionné)
ru: (выбран {0})

# Menu
source: Asset
fr: Ressource
ru: Актив

# Settings
source: Host
fr: Hôte

# Credentials
source: Host
fr: Hôte
