Repository: stride3d/stride
Catalog: sources/localization/*/Stride.Core.Assets.Editor.*.po
Languages: es, fr, ru

# Settings
source: Always delete {0} without asking
es: Siempre eliminar los siguientes archivos {0} sin preguntar
fr: Toujours supprimer {0} sans demander
ru: Удалять без подтверждения {0}

# Settings
source: Always save new scripts without asking
es: Guardar siempre los nuevos scripts sin preguntar
fr: Toujours enregistrer les nouveaux scripts sans demander
ru: Всегда сохранять новые скрипты

# Settings
source: Environment
es: Entorno
fr: Environnement
ru: Окружение

# Settings
source: External tools
es: Herramientas externas
fr: Outils externes
ru: Внешние инструменты

# Settings
source: Interface
es: Interfaz
ru: Интерфейс

# Settings
source: Tools
es: Herramientas
fr: Outils
ru: Инструменты

# Settings
source: Default text editor
es: Editor de texto predeterminado
fr: Éditeur de texte par défaut
ru: Текстовый редактор по умолчанию

# Settings
source: Shader editor
es: Editor de shaders
fr: Éditeur de shader
ru: Редактор шейдеров

# Settings
source: Default IDE
es: IDE por defecto
fr: EDI par défaut
ru: Интегрированная среда разработки

# Settings
source: Ask before deleting assets
es: Preguntar antes de eliminar activos
fr: Demander avant de supprimer des ressources
ru: Подтверждение удаления активов

# Settings
source: Ask before reloading assemblies
es: Pregunte antes de recargar los ensamblajes
fr: Demander avant de recharger les ensembles
ru: Подтверждать перезапуск сборки

# Settings
source: Automatically reload assemblies
es: Recargar automáticamente los ensamblajes
fr: Recharger automatiquement les ensembles
ru: Автоматически перезапускать сборку

# Settings
source: Ask before saving new scripts
es: Preguntar antes de guardar nuevos scripts
fr: Demander avant d'enregistrer les nouveaux scripts
ru: Подтверждать сохранение новых скриптов

# Settings
source: Language
es: Idioma
fr: Langue
ru: Язык

# Settings
source: Reset
es: Reiniciar
fr: Réinitialiser
ru: Сброс

# Settings
source: Reset Game Studio layout
es: Reiniciar Game Studio
fr: Réinitialiser la disposition de Game Studio
ru: Сбросить макет Game Studio

# Settings
source: Use effect compiler server for mobile platforms
es: Usar el servidor de compilación de efectos para dispositivos móviles
fr: Utiliser le compilateur d'effets pour les plates-formes mobiles
ru: Использовать сервер компиляторов эффектов для мобильных платформ

# Settings
source: Automatically reload last session at startup
es: Cargar automáticamente la última sesión al inicio
fr: Recharger automatiquement la dernière session au démarrage
ru: Загружать последнюю сессию при запуске

# Message
source: Unable to use the selected template because it is not an asset template.
es: Imposible usar la plantilla seleccionada porque no es una plantilla de assets.
fr: Impossible d'utiliser le modèle sélectionné car ce n'est pas un modèle de ressource.
ru: Невозможно использовать выбранный шаблон, поскольку это не шаблон актива.

# Message
source: Unable to retrieve template generator for the selected template. Aborting.
es: No se ha podido recuperar el generador de plantillas para la plantilla seleccionada. Abortando.
fr: Impossible de récupérer de générateur de modèle pour le modèle sélectionné. Annulation.
ru: Невозможно сгенерировать выбранный шаблон. Отмена.

# Title
source: Add asset…
es: Añadir asset…
fr: Ajouter une ressource…
ru: Добавить актив…

# Message
source: Game Studio can't create assets in multiple locations. In the solution explorer, select a single directory or package to create the asset in.
es: Game Studio no puede crear assets en varias ubicaciones. En el explorador de soluciones, seleccione un único directorio o paquete para crear el asset.
fr: Game Studio ne peut pas créer des ressources à des emplacement différents. Dans l'explorateur de solution, sélectionnez un unique dossier ou paquet pour y créer la ressource.
ru: Game Studio не может создавать ресурсы в нескольких местах. Выберите в обозревателе решений один каталог или пакет для создания ресурса.

# Message
source: Game Studio can't create an asset here. In the solution explorer, select a directory or package to create the asset in.
es: Game Studio no puede crear un asset aquí. En el explorador de soluciones, seleccione un directorio o un paquete para crear el asset.
fr: Game Studio ne peut pas créer une ressource ici. Dans l'explorateur de solutions, sélectionnez un dossier ou paquet pour y créer la ressource.
ru: Game Studio не может создать актив здесь. В обозревателе решений выберите каталог или пакет для создания актива.

# Message
source: Game Studio can't create an asset here because the selected directory or package can't be edited. In the solution explorer, select a directory or package to create the asset in.
es: Game Studio no puede crear un asset aquí porque el directorio o paquete seleccionado no puede ser editado. En el explorador de soluciones, seleccione un directorio o paquete para crear el asset.
fr: Game Studio ne peut pas créer de ressource ici car le dossier ou paquet sélectionné ne peut pas être modifié. Dans l'explorateur de solution, sélectionnez un dossier ou paquet pour y créer la ressource.
ru: Game Studio не может создать ресурс здесь, потому что выбранный каталог или пакет не могут быть отредактированы. В обозревателе решений выберите каталог или пакет для создания ресурса.

# Message
source: Read-only folders can't be cut.
es: Los directorios de solo lectura no se puede cortar.
fr: Les dossiers en lecture seule ne peuvent pas être coupés.
ru: Папки только для чтения не могут быть вырезаны.

# Message
source: The asset {0} can't be deleted. {1}{2}
es: El asset {0} no puede ser eliminado. {1}{2}
fr: La ressource {0} ne peut pas être supprimée. {1}{2}
ru: Актив {0} не может быть удален. {1} {2}

# Message
source: {0} can't be deleted. {1}{2}
es: {0} no puede ser eliminado. {1}{2}
fr: {0} ne peut pas être supprimé. {1}{2}
ru: {0} не может быть удален. {1} {2}

# Message
source: Unable to cut or copy a selection that contains a folder and one of its subfolders.
es: No se puede cortar o copiar una selección que contiene un directorio y uno de sus subdirectorios.
fr: Impossible de couper ou copier la sélection qui contient un dossier et un de ses sous-dossiers.
ru: Невозможно вырезать или скопировать выделенное, которое содержит папку и одну из ее подпапок.

# Message
source: Select a valid asset folder to paste the selection to.
es: Seleccione un directorio de assets válidos para pegar la selección.
fr: Sélectionnez un dossier de ressource valide et collez-y la sélection.
ru: Выберите правильную папку активов, чтобы вставить в неё выбранное.

# Message
source: This package or directory can't be modified.
es: Este paquete o directorio no se puede modificar.
fr: Ce paquet ou dossier ne peut pas être modifié.
ru: Этот пакет или каталог не могут быть изменены.

# Message
source: This location is invalid. Please select a package folder in the Solution explorer.
es: Esta ubicación no es válida. Por favor, seleccione un directorio de paquetes en el explorador de soluciones.
fr: Cet emplacement est invalide. Veuillez sélectionner un dossier de paquet dans l'explorateur de solution.
ru: Это местоположение недействительно. Пожалуйста, выберите папку пакета в обозревателе решений.

# Message
source: Drop files
es: Arrastrar archivos
fr: Glisser-déposer des fichiers
ru: Перетащите файлы

# Message
source: These files aren't supported.
es: Estos archivos no son compatibles.
fr: Ces fichiers ne sont pas supportés.
ru: Эти файлы не поддерживаются.

# Message
source: Unable to rename asset to '{0}' because an asset with the same name exists in the same directory
es: Imposible renombrar el asset a '{0}' porque existe un asset con idéntico nombre en el mismo directorio
fr: Impossible de renommer la ressource en « {0} » car une ressource avec le même nom existe dans le même dossier
ru: Невозможно переименовать ресурс в '{0}', так как ресурс с тем же именем существует в том же каталоге

# Message
source: Unable to rename asset with an empty name
es: Imposible renombrar el asset con un nombre en blanco
fr: Impossible de renommer une ressource avec un nom vide
ru: Невозможно переименовать ресурс в пустоту

# Message
source: This package that contains this folder can't be edited.
es: El paquete que contiene este directorio no se puede editar.
fr: Ce paquet contenant ce dossier ne peut pas être modifié.
ru: Пакет содержащий эту папку, не может быть отредактирован.

# Message
source: Unable to rename folder. {0}
es: Imposible renombrar el directorio. {0}
fr: Impossible de renommer le dossier. {0}
ru: Невозможно переименовать папку. {0}

# Message
source: A folder with the same name already exists in the parent folder.
es: Ya existe un directorio con el mismo nombre en el direcorio principal.
fr: Un dossier avec le même nom existe déjà dans le dossier parent.
ru: Папка с таким именем уже существует в родительской папке.

# Message
source: Path is a device name
es: La ruta es un nombre de dispositivo
fr: Le chemin est un nom de périphérique
ru: Путь - имя устройства

# Button
source: Try again
es: Intentarlo de nuevo
fr: Veuillez réessayer
ru: Повторить

# Button
source: Cancel
es: Cancelar
fr: Annuler
ru: Отмена

# Message
source: The last attempt to load the project **{0}** failed. Do you want to try to load it again?
es: El último intento de cargar el proyecto ** {0} ** ha fallado. ¿Quieres probar a cargarlo otra vez?
fr: La dernière tentative de chargement du projet **{0}** a échoué. Voulez-vous essayer de le charger à nouveau ?
ru: Последняя попытка загрузить проект **{0}** не удалась. Попробовать загрузить его снова?

# Message
source: The file '{0}' does not exist.
es: El archivo '{0}' no existe.
fr: Le fichier « {0} » n'existe pas.
ru: Файл '{0}' не существует.

# Message
source: You need to save the file before you can open it.
es: Debe guardar el archivo antes de poder abrirlo.
fr: Vous devez enregistrer le fichier avant de pouvoir l'ouvrir.
ru: Вам нужно сохранить файл, прежде чем вы сможете его открыть.

# Message
source: An error occurred while opening the file.
es: Se ha producido un error al abrir el archivo.
fr: Un erreur s'est produite lors de l'ouverture du fichier.
ru: Ошибка при открытии файла.

# Message
source: This package couldn't be renamed. {0}
es: Este paquete no puede ser renombrado. {0}
fr: Ce paquet n'a pas pu être renommé. {0}
ru: Этот пакет не может быть переименован. {0}

# Message
source: A package with the same name already exists in the session.
es: Un paquete con el mismo nombre ya existe en la sesión.
fr: Un paquet avec le même nom existe déjà dans la session.
ru: В сессии уже существует пакет с таким именем.

# Message
source: The name is too long.
es: El nombre es demasiado largo.
fr: Le nom est trop long.
ru: Слишком длинное имя.

# Message
source: The name contains invalid characters.
es: El nombre contiene caracteres no válidos.
fr: Le nom contient des caractères invalides.
ru: Имя содержит недопустимые символы.

# Message
source: The name is empty.
es: El nombre está en blanco.
fr: Le nom est vide.
ru: Пустое имя.

source: External packages
es: Paquetes externos
fr: Paquets externes
ru: Внешние пакеты

source: Local packages
es: Paquetes locales
fr: Paquets locaux
ru: Локальные пакеты

source: Solution '{0}'
es: Solución '{0}'
ru: Решение '{0}'

# Title
source: Creating session...
es: Creando sesión...
fr: Création de la session…
ru: Создание сессии...

# Title
source: Opening session...
es: Abriendo sesión...
fr: Ouverture de la session…
ru: Сессия открывается...

# Log
source: There was a problem opening the solution.
es: Ha ocurrido un problema al abrir la solución.
fr: Un problème est survenu lors de l'ouverture de la solution.
ru: При открытии решения возникла ошибка.

# Message
source: The following dependencies in the **{0}** package need to be upgraded:
es: Las siguientes dependencias de paquetes ** {0} ** necesitan actualizarse:
fr: La dépendance suivante dans le paquet **{0}** doit être mise à jour :
ru: Следующие зависимости в пакете ** {0} ** необходимо обновить:

# Message
source: - Dependency to **{0}** must be upgraded from version **{1}** to **{2}**
es: - La dependencia **{0}** debe actualizarse de la versión **{1}** a **{2}**
fr: - La dépendance à **{0}** doit être mise à jour de la version **{1}** vers la version **{2}**
ru: - Зависимость **{0}** должна быть обновлена с версии **{1}** до **{2}**

# Message
source: Upgrading assets might break them. We recommend you make a manual backup of your project before you upgrade.
es: Al actualizar los assets estos se podrían romper. Le recomendamos que haga una copia de seguridad manual de su proyecto antes de realizar la actualización.
fr: La mise à jour des ressources pourrait les corrompre. Nous vous recommandons de faire une sauvegarde manuelle de votre projet avant la mise à jour.
ru: Обновление активов может сломать их. Мы рекомендуем вам сделать резервную копию вашего проекта перед обновлением.

# Button
source: Upgrade
es: Actualizar
fr: Mettre à niveau
ru: Обновить

# Button
source: Skip
es: Omitir
fr: Ignorer
ru: Пропустить

# Message
source: Do this for every package in the solution
es: Hacer esto para cada paquete de la solución
fr: Effectuer cette action pour tous les paquets dans la solution
ru: Сделайте это для каждого пакета в решении

# Button
source: Save
es: Guardar
fr: Enregistrer
ru: Сохранить

# Message
source: This asset has unsaved changes. To open it, you need to save the session first. Do you want to save now?
es: Este asset tiene modificaciones sin guardar. Para abrirlo, primero debe guardar la sesión. ¿Desea guardar ahora?
fr: Cette ressource possède des modifications non enregistrées. Pour l'ouvrir, vous devez d'abord enregistrer la session. Voulez-vous enregistrer maintenant ?
ru: Этот актив имеет не сохраненные изменения. Чтобы открыть его, сначала нужно сохранить сессию. Сохранить сейчас?

# Message
source: There was a problem starting the text editor. Make sure the path to the text editor in Settings is correct.
es: Hubo un problema al iniciar el editor de texto. Asegúrese de que la ruta del editor en la configuración es correcta.
fr: Un problème est survenu lors du lancement de l'éditeur de texte. Veuillez vérifier que le chemin vers l'éditeur de texte est correct dans les paramètres.
ru: При запуске текстового редактора возникла ошибка. Убедитесь, что путь к текстовому редактору в настройках указан правильно.

# Message
source: This asset has unsaved changes. To open it, you need to save it first. Do you want to save the session now?
es: Este asset tiene cambios sin guardar. Para abrirlo, debe guardarlo primero. ¿Desea guardar la sesión ahora?
fr: Cette ressource possède des modifications non enregistrées. Pour l'ouvrir, vous devez d'abord l'enregistrer. Voulez-vous enregistrer la session maintenant ?
ru: Этот актив имеет не сохраненные изменения. Чтобы открыть его, сначала нужно его сохранить. Сохранить сейчас?

# Message
source: This asset doesn't have a source file to open.
es: Este asset no tiene un archivo de origen para abrir.
fr: Cette ressource ne possède pas de fichier source à ouvrir.
ru: Этот ресурс не имеет исходного файла для открытия.

# Message
source: You need to save the asset before you can explore it.
es: Es necesario guardar el asset antes de poder visualizarlo.
fr: Vous devez enregistrer la ressource avant de pouvoir l'explorer.
ru: Вам нужно сохранить актив, прежде чем вы сможете с ним что-то делать.

# Message
source: There was a problem starting the file explorer.
es: Hubo un problema al iniciar el explorador de archivos.
fr: Un problème est survenu lors du lancement de l'explorateur.
ru: При запуске файлового менеджера возникла ошибка.

# Title
source: Saving session...
es: Guardando sesión...
fr: Enregistrement de la session…
ru: Сохранение сессии...

# Log
source: There was a problem saving the solution. {0}
es: Hubo un problema al guardar la solución. {0}
fr: Un problème est survenu lors de l'enregistrement de la solution. {0}
ru: При сохранении решения возникла ошибка. {0}

# Button
source: Don't save
es: No guardar
fr: Ne pas enregistrer
ru: Не сохранять

# Message
source: The project has unsaved changes. Do you want to save it?
es: El proyecto tiene cambios sin guardar. ¿Desea guardar?
fr: Le projet possède des modifications non enregistrées. Voulez-vous le sauvegarder ?
ru: Проект имеет не сохраненные изменения. Сохранить?

# Message
source: Some assets couldn't be saved. Check the assets and try again.
es: Algunos assets no han podido guardarse. Revise los assets y vuelva a intentarlo.
fr: Certaines ressources n'ont pas pu être enregistrées. Vérifiez les ressources et réessayez.
ru: Некоторые активы не сохранились. Проверьте и попробуйте снова.

# Title
source: Creating project...
es: Creando proyecto...
fr: Création du projet…
ru: Создание проекта...

# Title
source: Importing project...
es: Importando proyecto...
fr: Importation du projet…
ru: Импорт проекта...

# Log
source: There was a problem importing the package.
es: Hubo un problema al importar el paquete.
fr: Un problème est survenu lors de l'importation du paquet.
ru: Возникла проблема с импортом пакета.

# Message
source: Please select a single package.
es: Por favor, seleccione un único paquete.
fr: Veuillez sélectionner un seul paquet.
ru: Пожалуйста, выберите один пакет.

# Message
source: There are no packages that can be added as dependencies to this package.
es: No hay paquetes que se puedan añadir como dependencias a este paquete.
fr: Il n'y a aucun paquet pouvant être ajouté comme dépendance de ce paquet.
ru: Нет пакетов, которые можно было бы добавить в этот пакет в качестве зависимостей.

# Message
source: Folders can only be created in the Assets hierarchy of a package.
es: Los directorios sólo se pueden crear en la jerarquía de assets de un paquete.
fr: Les dossier ne peuvent être crées que dans l'arborescence d'une ressource d'un paquet.
ru: Папки могут быть созданы только в иерархии пакетов, папок.

# Message
source: Game Studio can't create a folder in some of the locations you selected. Folders can only be created in the Assets hierarchy of a package.
es: Game Studio no puede crear un directorio en algunas de las ubicaciones seleccionadas. Las carpetas sólo se pueden crear en la jerarquía de assets de un paquete.
fr: Game Studio ne peut pas créer de dossier dans certains des emplacements que vous avez sélectionné. Les dossiers ne peuvent être créés que dans l'arborescence d'une ressource d'un paquet.
ru: Game Studio не может создать папку в некоторых местах, в том числе которое вы выбрали. Папки могут быть созданы только в иерархии пакетов и папок.

# Settings
source: Always delete without asking
es: Siempre eliminar sin preguntar
fr: Toujours supprimer sans demander
ru: Удалять без подтверждения

# Button
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

# Message
source: Stride can't delete the {0} asset. {1}{2}
es: Stride no puede eliminar el asset {0}. {1} {2}
fr: Stride ne peut pas supprimer la ressource {0}. {1}{2}
ru: Stride не может удалить актив {0}. {1} {2}

# Message
source: Stride can't delete the {0} folder. {1}{2}
es: Stride no puede eliminar el directorio de {0}. {1} {2}
fr: Stride ne peut pas supprimer le dossier {0}. {1}{2}
ru: Stride не может удалить папку {0}. {1} {2}

# Message
source: Stride can't delete the system package.
es: Stride no puede eliminar el paquete del sistema.
fr: Stride ne peut pas supprimer le paquet système.
ru: Stride не может удалить системный пакет.

# Message
source: Are you sure you want to delete this package? The package files will remain on the disk.
es: ¿Está seguro que desea eliminar este paquete? Los archivos del paquete permanecerán en el disco.
fr: Êtes-vous sûr de vouloir supprimer ce paquet ? Les fichiers du paquet seront conservés sur le disque.
ru: Вы уверены, что хотите удалить этот пакет из сессии? Сами файлы пакета останутся на диске, но в сессии их не будет.

# Message
source: Are you sure you want to delete this dependency?
es: ¿Está seguro que desea eliminar esta dependencia?
fr: Êtes-vous sûr de vouloir supprimer cette dépendance ?
ru: Вы уверены, что хотите удалить эту зависимость?

# Message
source: Asset root folders can't be deleted.
es: No se pueden eliminar los directorios raíz de los assets.
fr: Les dossiers racines d'une ressource ne peuvent pas être supprimés.
ru: Корневая папка активов не может быть удалена.

# Message
source: Are you sure you want to delete these projects?
es: ¿Está seguro que desea eliminar estos proyectos?
fr: Êtes-vous sûr de vouloir supprimer ces projets ?
ru: Вы уверены, что хотите удалить эти проекты?

# Properties
source: Loading properties...
es: Cargando propiedades...
fr: Chargement des propriétés...
ru: Загрузка свойств...

# Properties
source: There was a problem loading properties of the selection.
es: Ha ocurrido un problema cargando las propiedades de la selección.
fr: Un problème est survenu lors du chargement des propriétés de la sélection.
ru: Выбранные свойства загрузить не удалось.

# Log
source: Operation cancelled.
es: Operación cancelada.
fr: Opération annulée.
ru: Операция отменена.

# Log
source: An exception occurred while generating the template.
es: Se ha producido una excepción al generar la plantilla.
fr: Un erreur s'est produite lors de la génération du modèle.
ru: Возникла ошибка при создании шаблона.

# Message
source: Some changes will be applied after you restart Game Studio.
es: Algunos cambios se aplicarán después de reiniciar Game Studio.
fr: Certaines modifications ne seront appliquées qu'une fois que vous aurez redémarré Game Studio.
ru: Некоторые изменения будут применены после перезапуска Game Studio.

# Properties
source: Select a settings category.
es: Seleccione una categoría de configuración.
fr: Sélectionnez une catégorie de paramètres.
ru: Выберите категорию настроек.

# Properties
source: There was a problem loading the Settings page.
es: Ha ocurrido un problema al cargar la página de configuración.
fr: Un problème est survenu lors du chargement de la page des paramètres.
ru: При загрузке страницы настроек произошла ошибка.

source: (Different values)
es: (Valores diferentes)
fr: (Valeurs différentes)
ru: (Разные значения)

# Title
source: Project selection - {0}
es: Selección de proyecto - {0}
fr: Sélection du projet - {0}
ru: Выбор проекта - {0}

# Message
source: Can't drop here
es: No se puede soltar aquí
fr: Impossible de glisser-déposer ici
ru: Не могу переместить именно сюда

source: Select an asset
es: Seleccione un asset
fr: Sélectionner une ressource
ru: Выбрать актив

# Menu
source: Asset
fr: Ressource
ru: Актив

# Menu
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

# Menu
source: Rename
es: Renombrar
fr: Renommer
ru: Переименовать

# Menu
source: Explore
es: Explorar
fr: Explorer
ru: Проводник

# Menu
source: OpenWithTextEditor
es: AbrirConEditorDeTexto
ru: Открыть в текстовом редакторе

# Menu
source: OpenAssetFile
es: AbrirAsset
ru: Открыть актив

# Menu
source: OpenSourceFile
es: AbrirCodigoFuente
ru: Открыть исходный файл

# Menu
source: ShowInExplorer
es: MostrarEnExplorer
ru: Показать в проводнике

# Button
source: OK
es: De acuerdo
ru: Ок

# ToolTip
source: Select these assets
es: Seleccione estos assets
fr: Sélectionner ces ressources
ru: Выбрать эти активы

# ToolTip
source: Cancel (Esc)
es: Cancelar (Esc)
fr: Annuler (Échap)
ru: Отмена (Esc)

source: Name: {0}
es: Nombre: {0}
fr: Nom : {0}
ru: Имя: {0}

source: Type: {0}
es: Tipo: {0}
ru: Тип: {0}

source: URL: {0}
ru: Ссылки: {0}

source: Tags: {0}
es: Etiquetas: {0}
fr: Étiquettes : {0}
ru: Тэги: {0}

source: Included in build as root
es: Incluido en la compilación como raíz
fr: Inclus comme racine dans la compilation
ru: Включено в сборку как корневой ресурс
