Repository: stride3d/stride
Catalog: sources/localization/*/Stride.Assets.Presentation.*.po
Languages: ru

# Settings
source: Key bindings
ru: Назначение клавиш

# Settings
source: Scene editor
ru: Редактор сцен

# Settings
source: Viewport settings
ru: Настройки окна просмотра

# Settings
source: Move camera forward
ru: Перемещение камеры вперед

# Settings
source: Move camera backward
ru: Перемещение камеры назад

# Settings
source: Move camera left
ru: Перемещение камеры влево

# Settings
source: Move camera right
ru: Перемещение камеры вправо

# Settings
source: Move camera up
ru: Перемещение камеры вверх

# Settings
source: Move camera down
ru: Перемещение камеры вниз

# Settings
source: Invert mouse panning axis
ru: Инвертировать ось мышки

# Settings
source: Center view on selection
ru: Вид по центру выделенного элемента

# Settings
source: Snap selection to the grid
ru: Выбор привязки к сетке

# Settings
source: Switch to translation mode
ru: Переключиться в режим перемещения

# Settings
source: Switch to rotation mode
ru: Переключиться в режим вращения

# Settings
source: Switch to scale mode
ru: Переключиться в режим масштабирования

# Settings
source: Switch to next gizmo mode
ru: Переключиться в следующий режим

# Settings
source: Default snap distance for translation
ru: Шаг перемещений по умолчанию

# Settings
source: Default snap angle for rotation
ru: Шаг угла поворота по умолчанию

# Settings
source: Default snap factor for scale
ru: Шаг масштаба по умолчанию

# Settings
source: Ask before deleting entities
ru: Подтверждение для удаления объектов

# Button
source: Create
ru: Создать

# Button
source: Select a source...
ru: Выбрать источник...

# Button
source: Cancel
ru: Отмена

# Message
source: Do you want to create this {0} without a source file?
ru: Вы хотите создать этот {0} без исходного файла?

# Message
source: Select an orientation.
ru: Выберите направление.

# Message
source: Select at least one platform.
ru: Выберите хотя бы одну платформу.

# Message
source: Type a valid namespace name. Error with {0}
ru: Введите допустимое имя из пространства имен. Ошибка {0}

# Message
source: Type a valid library name. Error with {0}
ru: Введите допустимое имя библиотеки. Ошибка {0}

# Message
source: The names you entered are invalid or empty.
ru: Введенное имя недопустимо или отсутствует.

# Button
source: Save
ru: Сохранить

# Message
source: You can't use scripts until you save them. Do you want to save now?
ru: Вы не можете использовать сценарии, пока их не сохраните. Сохранить сейчас?

# Message
source: You must select at least one platform.
ru: Необходимо выбрать хотя бы одну платформу.

# Button
source: Remove
ru: Удалить

# Message
source: Are you sure you want to remove these {0} platform(s) from the package?
ru: Вы уверены, что хотите удалить эти платформы из пакета?

# Message
source: Game Studio can't auto-reload the project file {0} because you have local changes such as new or deleted scripts. Click OK to keep reloading or Cancel to keep the current version.
ru: Game Studio не может автоматически перезагрузить файл проекта {0}, так как у вас есть локальные изменения, такие как новые или удаленные сценарии(скрипты). Нажмите OK, чтобы продолжить перезагрузку, или отмена, чтобы сохранить текущую версию.

# Message
source: The following source files in the {0} project have been deleted externally, but have unsaved changes in Game Studio. Do you want to delete these files? {1}
ru: Следующие исходные файлы в проекте {0} были удалены извне, но имеют несохраненные изменения в Game Studio. Вы хотите удалить эти файлы? {1}

# Message
source: {0} This file has been changed externally and has unsaved changes inside the editor. Do you want to reload it and lose your changes?
ru: {0} Этот файл был изменен извне и имеет не сохраненные изменения в Редакторе. Вы хотите перезагрузить его и потерять свои изменения?

# Message
source: **Only static fonts can be precompiled.** Clear the _Is Dynamic_ property on this font and try again.
ru: **Только статические шрифты могут быть предварительно скомпилированы.** Очистите _Is Dynamic_property этого шрифта и повторите попытку.

# Message
source: Which color space do you want to use?
ru: Какое цветовое пространство использовать?

source: Use translation gizmo
ru: Перемещение

source: Use rotation gizmo
ru: Вращение

source: Use scale gizmo
ru: Масштаб

source: Use world coordinates for transformations
ru: Использование мировых координат для преобразований

source: Use local coordinates for transformations
ru: Использовать локальные координаты для преобразований

source: Use current camera projection coordinates for transformations
ru: Использовать текущие координаты проекции камеры для преобразований

# Settings
source: Script editor
ru: Редактор сценариев

# Settings
source: Font size
ru: Размер шрифта

# Settings
source: UI editor
ru: Редактор пользовательского интерфейса

# Settings
source: Ask before deleting UI elements
ru: Спрашивать перед удалением элементов пользовательского интерфейса

# Message
source: Unable to rename the folder '{0}' to '{1}'. A folder with the same name already exists.
ru: Не удается переименовать папку '{0}' в '{1}'. Папка с таким именем уже существует.

# Message
source: Are you sure you want to delete this entity?
ru: Вы уверены, что хотите удалить этот объект?

# Message
source: Are you sure you want to delete these {0} entities?
ru: Вы уверены, что хотите удалить {0} сущность(и/ей)?

# Button
source: Delete
ru: Удалить

# Message
source: Couldn't find the file
ru: Файл не найден

# Message
source: There was a problem while editing the image.{0}
ru: Возникла проблема при редактировании изображения.{0}

# Message
source: There was a problem opening Explorer.{0}
ru: Возникла проблема с открытием проводника.{0}

# Message
source: Are you sure you want to delete this UI element?
ru: Вы уверены, что хотите удалить этот элемент пользовательского интерфейса?

# Message
source: Are you sure you want to delete these {0} UI elements?
ru: Вы уверены, что хотите удалить это кол-во элементов {0} пользовательского интерфейса?

source: Create a game...
ru: Создать игру...

source: Namespace:
ru: Пространство имен:

source: Platforms
ru: Платформы

source: This machine doesn't meet the requirements to build for this platform.
ru: Эта машина не отвечает требованиям для сборки на этой платформе.

source: Asset packs
ru: Пакеты активов

source: Rendering
ru: Визуализация

# Button
source: High dynamic range (HDR)
ru: Графика высоко (HDR)

# Button
source: Low dynamic range (LDR)
ru: Графика низко (LDR)

# Button
source: OK
ru: Ок

source: Import from model
ru: Импорт из модели

source: Materials and textures
ru: Материалы и текстуры

# Button
source: Import materials
ru: Импортировать материалы

# Button
source: Import textures
ru: Импортировать текстуры

source: Skeleton
ru: Скелет

# Button
source: Import skeleton
ru: Импортировать скелет

# Button
source: No skeleton
ru: Нет скелета

# Button
source: Use another skeleton for this model:
ru: Использовать другой скелет:

source: New code library
ru: Новая библиотека скриптов

source: Library name:
ru: Имя библиотеки:

source: New script
ru: Новый скрипт

# Button
source: Create script
ru: Создать скрипт

source: Class:
ru: Класс:

source: Select platforms
ru: Выбор платформы

source: (This will remove the project from the package and disk.)
ru: (Это приведет к удалению проекта из пакета и диска.)

# Button
source: Force regeneration of all platform projects
ru: Принудительная регенерация всех проектов для данной платформы

# ToolTip
source: Play the animation
ru: Воспроизведение анимации

# ToolTip
source: Pause the animation
ru: Приостановить анимацию

source: Time scale:
ru: Шкала времени:

# ToolTip
source: Reset the camera
ru: Сброс камеры

source: Scenes can't be previewed. To see the scene, open it in the scene editor.
ru: Сцены не могут быть просмотрены. Чтобы увидеть сцену, откройте ее в Редакторе сцен.

# ToolTip
source: Play the sound
ru: Воспроизвести звук

# ToolTip
source: Pause the sound
ru: Приостановить звук

source: Building preview sound asset...
ru: Пред.просмотр собранного звука...

# ToolTip
source: Previous sprite
ru: Предыдущий спрайт

source: Sprite:
ru: Спрайт:

# ToolTip
source: Next sprite
ru: Следующий спрайт

source: Preview text
ru: Предварительный просмотр текста

# ToolTip
source: Previous slice
ru: Предыдущий фрагмент

# ToolTip
source: Next slice
ru: Следующий фрагмент

source: W: {0}
ru: Длина: {0}

source: H: {0}
ru: Высота: {0}

source: Add component
ru: Добавить компонент

# ToolTip
source: Edit curve
ru: Изменить кривую

source: (Different values)
ru: (Разные значения)

# Button
source: Refresh
ru: Обновить

source: Live scripting debugger
ru: Отладчик "живой скрипт"

# ToolTip
source: Select these assets
ru: Выбрать эти активы

# ToolTip
source: Cancel (Esc)
ru: Отмена (Esc)

# ToolTip
source: Select an asset
ru: Выбрать актив

# ToolTip
source: Clear the reference
ru: Очистить ссылку

# ToolTip
source: Select the referenced asset
ru: Выберите референсный актив

# ToolTip
source: Highlight this material in the scene editor
ru: Выделить этот материал в редакторе сцен

source: Select shader...
ru: Выберите шейдер...

# Button
source: All
ru: Все

# Button
source: None
ru: Нет

# ToolTip
source: Remove the selected curve
ru: Удалить выбранную кривую

source: Curves:
ru: Кривые:

# ToolTip
source: Show or hide the tracker
ru: Показать или скрыть шкалу

# ToolTip
source: Fit view to curve
ru: Подогнать вид к кривой

# ToolTip
source: Fit view to curve height
ru: Подгонка вида по высоте кривой

# ToolTip
source: Fit view to curve width
ru: Подгонка вида по ширине кривой

# ToolTip
source: Delete selected points
ru: Удалить выбранные точки

# ToolTip
source: First key
ru: Первый ключ

# ToolTip
source: Previous key
ru: Предыдущий ключ

# ToolTip
source: Next key
ru: Следующий ключ

# ToolTip
source: Last key
ru: Последний ключ

source: Key
ru: Ключ

source: Value
ru: Значение

# Menu
source: Curve
ru: Кривая

# Menu
source: Add point
ru: Добавить точку

# Menu
source: Delete selected points
ru: Удалить выбранные точки

# Menu
source: Clear whole curve
ru: Очистить всю кривую

# Menu
source: View
ru: Вид

# Menu
source: Fit to curve
ru: Вписать в кривую

# Menu
source: Fit to curve height
ru: По высоте кривой

# Menu
source: Fit to curve width
ru: Подгонка по ширине кривой

# Menu
source: Create
ru: Создать

# Menu
source: Folder
ru: Папка

# Menu
source: Empty entity
ru: Пустой объект

# Menu
source: Actions
ru: Действие

# Menu
source: Open prefab in editor
ru: Редактировать префаб

# Menu
source: Select prefab in asset view
ru: Выберите префаб в окне активов

# Menu
source: Break link to prefab
ru: Сделать независимым от префаба

# Menu
source: Create prefab from selection
ru: Создать префаб из выбранного

# Menu
source: Duplicate
ru: Дублировать

# Menu
source: Set as active scene
ru: Установить сцену в качестве активной

# Menu
source: Rename
ru: Переименовать

source: Loading scene...
ru: Загрузка сцены...

source: This might take a few minutes the first time.
ru: В первый раз это может занять несколько минут.

# ToolTip
source: Create a new entity
ru: Создать новую сущность(объект)

# Menu
source: New folder
ru: Новая папка

# ToolTip
source: Filter entities by name
ru: Фильтровать сущности(объекты) по имени

# ToolTip
source: Expand all entities
ru: Развернуть все сущности(объекты)

# ToolTip
source: Collapse all entities
ru: Схлопнуть все сущности(объекты)

source: Loading...
ru: Загрузка...

source: Unloading...
ru: Выгрузка...

# ToolTip
source: Focus on this entity (F)
ru: Сфокусировать на этой сущности(объекте) (F)

# ToolTip
source: Lock/unlock this entity
ru: Заблокировать/разблокировать эту сущность(объект)

# ToolTip
source: (Hold Ctrl to apply to child entities recursively)
ru: (Удерживайте Ctrl для рекурсивного применения к дочерним сущностям(объектам)

# ToolTip
source: Lock/unlock all entities
ru: Заблокировать/разблокировать все сущности(объекты)

# ToolTip
source: (Hold Ctrl to apply to child scenes recursively)
ru: (Удерживайте Ctrl для рекурсивного применения к дочерним сценам)

# ToolTip
source: Load/unload all entities
ru: Загрузка/выгрузка всех сущностей(объектов)

source: (Unloaded)
ru: (Выгружен)

# ToolTip
source: Light probes and cubemaps...
ru: Световые зонды и кубические карты...

source: Light probes
ru: Световые зонды

source: Bounces:
ru: Отражения:

# ToolTip
source: Compute lighting using light probes
ru: Вычисление освещения с помощью световых зондов

# ToolTip
source: Reset light probes
ru: Сбросить световые зонды

source: Reset
ru: Сброс

source: Cubemap
ru: Кубические карты

# ToolTip
source: Generate a cubemap from the scene view and save as a texture
ru: Создание кубической карты из вида сцены и сохранение в виде текстуры

source: Capture
ru: Захват

# ToolTip
source: Navigation visibility...
ru: Визуализировать навигацию...

source: Show navigation meshes:
ru: Показать навигационные сетки:

# ToolTip
source: Grid and gizmo options...
ru: Параметры сетки и указателя осей...

source: Transformation gizmo size:
ru: Размер указателя осей:

source: Component gizmo size:
ru: Размер компонентных указателей:

# Button
source: Fixed
ru: Фиксировано

# Button
source: Camera preview
ru: Пред.просмотр камеры

# Button
source: Light probe volumes
ru: Световой зонд

# Button
source: Other entities
ru: Другие сущности(объекты)

# ToolTip
source: Editor camera options...
ru: Редактор параметров камеры...

source: Projection
ru: Проекция

# Button
source: Perspective
ru: Перспектива

# Button
source: Orthographic
ru: Ортогонально

source: Near plane:
ru: Ближняя плоскость:

source: Far plane:
ru: Дальняя плоскость:

source: Field of view:
ru: Угол обзора:

source: Orthographic size:
ru: Ортогональный размер:

source: Movement
ru: Перемещение

source: Speed:
ru: Скорость:

source: Orientation
ru: Направление

# Button
source: Front
ru: Спереди

# Button
source: Back
ru: Сзади

# Button
source: Top
ru: Сверху

# Button
source: Bottom
ru: Снизу

# Button
source: Left
ru: Слева

# Button
source: Right
ru: Справа

# ToolTip
source: Snap translations to this value
ru: Задать значение для перемещения

# ToolTip
source: Snap rotations to this value
ru: Задать значение для вращения

# ToolTip
source: Snap scale to this factor
ru: Задать значение для масштаба

# ToolTip
source: Toggle material selection (click a selected asset to select its material)
ru: Переключить на выбор материала (щелкните выбранный актив, чтобы выбрать его материал)

# ToolTip
source: Show or hide selection mask
ru: Показать или скрыть маску выделения

source: Loading assets...
ru: Загрузка активов...

# Menu
source: Open in prefab editor
ru: Редактировать префаб

source: Before you resume, fix the failing asset (likely a graphics compositor or scene).
ru: Перед возобновлением исправьте неисправный ресурс (скорее всего, графический композитор или сцену).

# Button
source: Resume
ru: Возобновить

# Button
source: Copy error to clipboard
ru: Скопировать ошибку в буфер обмена

source: Select an entity
ru: Выберите сущность(объект)

# ToolTip
source: Select the selected assets
ru: Выбрать отмеченные активы

source: Select an entity:
ru: Выберите сущность(объект):

source: (Index: {0})
ru: (Индекс: {0})

# Menu
source: Action
ru: Действие

# Menu
source: Delete selection
ru: Удалить выбранное

source: Render stages:
ru: Этап рендеринга:

source: Render features:
ru: Особенности рендеринга:

source: Camera slots:
ru: Слоты камеры:

# ToolTip
source: Toggle between find and replace modes
ru: Переключение между режимами поиска и замены

# ToolTip
source: Replace next (Alt+R)
ru: Заменить следующий (Alt+R)

# ToolTip
source: Replace all (Alt+A)
ru: Заменить все (Alt+A)

source: No suggestions
ru: Нет вариантов

# Button
source: Sprite sheet properties
ru: Свойства спрайт-листа

source: Sheet type:
ru: Тип листа:

# Button
source: Use color key
ru: Использовать цветовой ключ

# ToolTip
source: If enabled, the sprite uses the given color as transparency
ru: Если этот параметр включен, спрайт использует заданный цвет в качестве прозрачности

# ToolTip
source: To select the color key, select a pixel color from the image
ru: Чтобы выбрать ключ цвета, выберите цвет пикселя на изображении

# ToolTip
source: Add a new empty sprite
ru: Добавить новый пустой спрайт

# ToolTip
source: Duplicate selected sprites
ru: Дублировать выбранный спрайт

# ToolTip
source: Delete selected sprites
ru: Удалить выбранный спрайт

# ToolTip
source: Move selected sprites up
ru: Переместить выбранные спрайты вверх

# ToolTip
source: Move selected sprites down
ru: Переместить выбранные спрайты вниз

source: Sprites:
ru: Спрайты:

# Menu
source: Add new sprite
ru: Добавить новый спрайт

# Menu
source: Duplicate sprite
ru: Дублировать спрайт

# Menu
source: Edit image
ru: Редактировать изображение

# Menu
source: Show image in explorer
ru: Показать изображение в проводнике

source: Select a single image from the left panel
ru: Выберите одно изображение на левой панели

# ToolTip
source: Select previous sprite
ru: Выбрать предыдущий спрайт

# ToolTip
source: Select next sprite
ru: Выбрать следующий спрайт

# ToolTip
source: Zoom out
ru: Уменьшить

# ToolTip
source: Zoom in
ru: Увеличить

# ToolTip
source: Scale to real pixel size
ru: Масштаб до реального размера пикселя

# ToolTip
source: Fit image to screen
ru: Подогнать размер изображения под экран

# ToolTip
source: Center view on current sprite region
ru: Центральный вид текущей области спрайта

# ToolTip
source: Change selection rectangle color
ru: Изменить цвет прямоугольника выделения

# ToolTip
source: Highlight the current selection
ru: Подсветить текущее выделение

# ToolTip
source: Select entire image
ru: Выбрать всё изображение

# ToolTip
source: Select the sprite region using the magic wand
ru: Выберите область спрайта с помощью волшебной палочки

# Button
source: Use transparency
ru: Использовать прозрачность

# ToolTip
source: Move the sprite center
ru: Перемещение центра спрайта

# ToolTip
source: Resize the sprite borders
ru: Изменение размера границ спрайта

# ToolTip
source: Unlock the sprite borders
ru: Разблокировать границы спрайта

# ToolTip
source: Lock the sprite borders
ru: Блокировка границ спрайта

# Menu
source: Layout
ru: Макет

# Menu
source: Group into
ru: Сгруппировать

# Menu
source: Ungroup
ru: Разгруппировать

# Menu
source: Change layout type
ru: Изменить тип макета

# Menu
source: Pin origin
ru: Начало координат

# Menu
source: Top left
ru: Верхний левый угол

# Menu
source: Top
ru: Вверху

# Menu
source: Top right
ru: Вверху справа

# Menu
source: Left
ru: Слева

# Menu
source: Center
ru: По центру

# Menu
source: Right
ru: Справа

# Menu
source: Bottom left
ru: Слева внизу

# Menu
source: Bottom
ru: Снизу

# Menu
source: Bottom right
ru: Справа внизу

# Menu
source: Front
ru: Спереди

# Menu
source: Middle
ru: Посредине

# Menu
source: Back
ru: Сзади

# Menu
source: Row
ru: В ряд

# Menu
source: Move up
ru: Сместить вверх

# Menu
source: Move down
ru: Сместить вниз

# Menu
source: Column
ru: Колонка

# Menu
source: Move left
ru: Сместить влево

# Menu
source: Move right
ru: Сместить вправо

# Menu
source: Layer
ru: Слой

# Menu
source: Move back
ru: Сместить назад

# Menu
source: Move front
ru: Сместить вперёд

# Menu
source: Open library in editor
ru: Редактировать библиотеку

# Menu
source: Select library in asset view
ru: Выбрать библиотеку в окне активов

# Menu
source: Break link to library
ru: Разорвать связь с библиотекой

# Menu
source: Create page from selection
ru: Создать страницу из выбранного

# Menu
source: Create library from selection
ru: Создать библиотеку из выбранного

# Menu
source: Zoom in
ru: Увеличить

# Menu
source: Zoom out
ru: Уменьшить

# Menu
source: Reset camera
ru: Сброс камеры

# Button
source: UI properties
ru: Свойства пользовательского интерфейса

source: UI library
ru: Библиотека пользовательского интерфейса

# ToolTip
source: Expand all elements
ru: Развернуть все элементы

# ToolTip
source: Collapse all elements
ru: Свернуть все элементы

# ToolTip
source: Reset zoom
ru: Сброс масштаба

# ToolTip
source: Snaps to this value (0 to disable)
ru: Привязка к этому значению (0 для отключения)

source: Colors
ru: Цвета

source: Guideline
ru: Директива

source: Highlight
ru: Выделить

source: Selection
ru: Выбор

source: Sizing
ru: Калибровка

source: Before you resume, fix the failing asset (likely a UI page or UI library).
ru: Прежде чем возобновить, нужно исправить сбой активов (скорее всего, страница пользовательского интерфейса или UI библиотеки).

# Menu
source: Get
ru: Взять

# Menu
source: Set
ru: Установить

source: Variables:
ru: Переменные:

source: Functions:
ru: Функция:

# Button
source: Static method
ru: Статический метод

source: Return type...
ru: Возвращаемый тип...

source: Function parameters:
ru: Параметр функции:
