Repository: stride3d/stride
Catalog: sources/localization/*/Xenko.Assets.Presentation.*.po
Languages: es, fr

# Message
source: Unable to rename the folder '{0}' to '{1}'. A folder with the same name already exists.
es: No se ha podido renombrar el directorio '{0}' a '{1}'. Ya existe un directorio con el mismo nombre.
fr: Impossible de renommer le dossier « {0} » en « {1} ». Un dossier avec le même nom existe déjà.

# Message
source: Are you sure you want to delete this entity?
es: ¿Está seguro de que desea eliminar esta entidad?
fr: Êtes-vous sûr de vouloir supprimer cette entité ?

# Message
source: Are you sure you want to delete these {0} entities?
es: ¿Está seguro de que desea eliminar estas {0} entidades?
fr: Êtes-vous sûr de vouloir supprimer ces {0} entités ?

# Button
source: Delete
es: Eliminar
fr: Supprimer

# Button
source: Cancel
es: Cancelar
fr: Annuler

source: Use translation gizmo
es: Usar el gizmo de traslación
fr: Utiliser le gadget de translation

source: Use rotation gizmo
es: Usar el gizmo de rotación
fr: Utiliser le gadget de rotation

source: Use scale gizmo
es: Usar el gizmo de escala
fr: Utiliser le gadget de mise à l'échelle

source: Use world coordinates for transformations
es: Utilizar las coordenadas del mundo para las transformaciones
fr: Utiliser les coordonnées du monde pour les transformations

source: Use local coordinates for transformations
es: Utilizar coordenadas locales para las transformaciones
fr: Utiliser les coordonnées locales pour les transformations

source: Use current camera projection coordinates for transformations
es: Utilizar las coordenadas de la proyección de la cámara actual para las transformaciones
fr: Utiliser les coordonnées de la projection de la caméra pour le transformations

# Settings
source: Script editor
es: Editor de scripts
fr: Éditeur de script

# Settings
source: Font size
es: Tamaño de la fuente
fr: Taille de la police

# Message
source: Couldn't find the file
es: No se pudo encontrar el archivo
fr: Impossible de trouver le fichier

# Message
source: There was a problem while editing the image.{0}
es: Hubo un problema al editar la imagen. {0}
fr: Il y a eu un problème lors de la modification de l'image. {0}

# Message
source: There was a problem opening Explorer.{0}
es: Hubo un problema al abrir el Explorador.{0}
fr: Il y a eu un problème lors de l'ouverture de l'explorateur. {0}

# Settings
source: UI editor
es: Editor de interfaz de usuario
fr: Éditeur d'interface

# Settings
source: Ask before deleting UI elements
es: Preguntar antes de eliminar elementos de la interfaz
fr: Demander avant de supprimer des éléments de l'interface

# Message
source: Are you sure you want to delete this UI element?
es: ¿Está seguro que desea eliminar este elemento de la interfaz de usuario?
fr: Êtes-vous sûr de vouloir supprimer cet élément de l'interface ?

# Message
source: Are you sure you want to delete these {0} UI elements?
es: ¿Está seguro de que desea eliminar estos {0} elementos de la interfaz de usuario?
fr: Êtes-vous sûr de vouloir supprimer ces {0} éléments de l'interface ?

# Settings
source: Key bindings
es: Atajos de teclado
fr: Raccourcis clavier

# Settings
source: Scene editor
es: Editor de escena
fr: Éditeur de scène

# Settings
source: Viewport settings
es: Ajustes del viewport
fr: Paramètres de la fenêtre

# Settings
source: Move camera forward
es: Mover la cámara hacia adelante
fr: Déplacer la caméra vers l'avant

# Settings
source: Move camera backward
es: Mover la cámara hacia atrás
fr: Déplacer la caméra vers l'arrière

# Settings
source: Move camera left
es: Mover la cámara a la izquierda
fr: Déplacer la caméra vers la gauche

# Settings
source: Move camera right
es: Mover la cámara a la derecha
fr: Déplacer la caméra vers la droite

# Settings
source: Move camera up
es: Mover la cámara hacia arriba
fr: Déplacer la caméra vers le haut

# Settings
source: Move camera down
es: Mover la cámara hacia abajo
fr: Déplacer la caméra vers le bas

# Settings
source: Invert mouse panning axis
es: Invertir el eje de desplazamiento del ratón
fr: Inverser l'axe panoramique de la souris

# Settings
source: Center view on selection
es: Centro de la vista en la selección
fr: Centrer la vue sur la sélection

# Settings
source: Snap selection to the grid
es: Selección de ajuste a la cuadrícula
fr: Aligner la sélection sur la grille

# Settings
source: Switch to translation mode
es: Cambiar a modo de traslación
fr: Basculer en mode translation

# Settings
source: Switch to rotation mode
es: Cambiar al modo de rotación
fr: Basculer en mode rotation

# Settings
source: Switch to scale mode
es: Cambiar al modo de escala
fr: Basculer en mode de mise à l'échelle

# Settings
source: Switch to next gizmo mode
es: Cambiar al siguiente modo de gizmo
fr: Passer au prochain mode

# Settings
source: Default snap distance for translation
es: Distancia de ajuste por defecto para la traslación
fr: Distance de capture par défaut pour la translation

# Settings
source: Default snap angle for rotation
es: Ángulo de ajuste predeterminado para la rotación
fr: Angle de capture par défaut pour la rotation

# Settings
source: Default snap factor for scale
es: Factor de ajuste por defecto para la escala
fr: Facteur de capture par défaut pour la mise à l'échelle

# Settings
source: Ask before deleting entities
es: Preguntar antes de eliminar entidades
fr: Demander avant de supprimer des entités

# Button
source: Create
es: Crear
fr: Créer

# Button
source: Select a source...
es: Seleccione una fuente...
fr: Sélectionner une source…

# Message
source: Do you want to create this {0} without a source file?
es: ¿Desea crear este {0} sin un archivo de origen?
fr: Voulez-vous vraiment créer ce {0} sans fichier source ?

# Message
source: Select an orientation.
es: Seleccione una orientación.
fr: Sélectionner une orientation.

# Message
source: Select at least one platform.
es: Seleccione al menos una plataforma.
fr: Sélectionnez au moins une plateforme.

# Message
source: Type a valid namespace name. Error with {0}
es: Escriba un nombre de espacio de nombres válido. Error con {0}
fr: Tapez un nom de namespace valide. Erreur avec {0}

# Message
source: Type a valid library name. Error with {0}
es: Escriba un nombre válido de la librería. Error con {0}
fr: Tapez un nom de bibliothèque valide. Erreur avec {0}

# Message
source: The names you entered are invalid or empty.
es: Los nombres introducidos no son válidos o están vacíos.
fr: Les noms que vous avez saisi sont invalides ou vides.

# Button
source: Save
es: Guardar
fr: Enregistrer

# Message
source: You can't use scripts until you save them. Do you want to save now?
es: No puede utilizar script hasta que se guarden. ¿Quieres guardar?
fr: Vous ne pouvez pas utiliser de scripts avant de les avoir enregistrés. Voulez-vous enregistrer maintenant ?

# Message
source: You must select at least one platform.
es: Debe seleccionar al menos una plataforma.
fr: Vous devez sélectionner au moins une plateforme.

# Button
source: Remove
es: eliminar
fr: Supprimer

# Message
source: Are you sure you want to remove these {0} platform(s) from the package?
es: ¿Está seguro de que desea eliminar estas {0} plataforma(s) del paquete?
fr: Êtes-vous sûr de vouloir supprimer ces {0} plateforme(s) du paquet ?

# Message
source: Game Studio can't auto-reload the project file {0} because you have local changes such as new or deleted scripts. Click OK to keep reloading or Cancel to keep the current version.
es: Game Studio no puede autorecargar el archivo de proyecto {0} porque tiene cambios locales tales como scripts nuevos o eliminados. Haga clic en Aceptar para recargar o cancelar para mantener la versión actual.
fr: Game Studio ne peut pas recharger automatiquement le fichier de projet {0} car vous avez des modifications en local comme des nouveaux scripts ou des scripts supprimés. Cliquez sur OK pour continuer le rechargement ou sur Annuler pour conserver la version actuelle.

# Message
source: The following source files in the {0} project have been deleted externally, but have unsaved changes in Game Studio. Do you want to delete these files? {1}
es: Los siguientes archivos de fuente en el proyecto {0} se han eliminado desde el exterior, pero con cambios en el estudio del juego sin guardar. ¿Desea eliminar estos archivos? {1}
fr: Les fichiers source suivant dans le projet {0} ont été supprimés depuis l'extérieur, mais vous avez des modifications non sauvegardées dans Game Studio. Voulez-vous supprimer ces fichiers ? {1}

# Message
source: {0} This file has been changed externally and has unsaved changes inside the editor. Do you want to reload it and lose your changes?
es: {0} Este archivo ha sido modificado externamente y tiene cambios no guardados dentro del editor. ¿Quieres recargarlo y perder tus cambios?
fr: {0} Ce fichier a été modifié depuis l'extérieur et vous avez des modifications non sauvegardées dans l'éditeur. Voulez-vous le recharger et perdre vos modifications ?

# Message
source: **Only static fonts can be precompiled.** Clear the _Is Dynamic_ property on this font and try again.
es: **Sólo se pueden precompilar fuentes estáticas.** Borre la propiedad _Is Dynamic_ de esta fuente e inténtelo de nuevo.
fr: **Seulement les polices statiques peuvent être pré-compilées.** Effacez la propriété _Est dynamique_ sur cette police est réessayez.

# Message
source: Which color space do you want to use?
es: ¿Qué espacio de color desea utilizar?
fr: Quel espace de couleur souhaitez-vous utiliser ?

# Menu
source: Create
es: Crear
fr: Créer

# Menu
source: Folder
es: Directorio
fr: Dossier

# Menu
source: Empty entity
es: Entidad vacía
fr: Entité vide

# Menu
source: Actions
es: Acciones

# Menu
source: Open prefab in editor
es: Abrir prefabs en el editor
fr: Ouvrir le prefab dans l'éditeur

# Menu
source: Select prefab in asset view
es: Seleccione prefab en la vista de assets
fr: Sélectionner le prefab dans la vue des ressources

# Menu
source: Break link to prefab
es: Romper el enlace con el prefab
fr: Rompre le lien vers le prefab

# Menu
source: Create prefab from selection
es: Crear prefab a partir de la selección
fr: Créer un prefab à partir de la sélection

# Menu
source: Duplicate
es: Duplicar
fr: Dupliquer

# Menu
source: Set as active scene
es: Establecer como escena activa
fr: Définir comme scène active

# Menu
source: Rename
es: Renombrar
fr: Renommer

source: Loading scene...
es: Cargando escena....
fr: Chargement de la scène…

source: This might take a few minutes the first time.
es: Esto puede tardar unos minutos la primera vez.
fr: Cela peut prendre quelques minutes la première fois.

# ToolTip
source: Create a new entity
es: Crear una nueva entidad
fr: Créer une nouvelle entité

# Menu
source: New folder
es: Nuevo directorio
fr: Nouveau dossier

# ToolTip
source: Filter entities by name
es: Filtrar entidades por nombre
fr: Filtrer les entités par nom

# ToolTip
source: Expand all entities
es: Expandir todas las entidades
fr: Étendre toutes les entités

# ToolTip
source: Collapse all entities
es: Colapsar todas las entidades
fr: Réduire toutes les entités

source: Loading...
es: Cargando...
fr: Chargement…

source: Unloading...
es: Descargando...
fr: Déchargement…

# ToolTip
source: Focus on this entity (F)
es: Centrarse en esta entidad (F)
fr: Focus sur cette entité (F)

# ToolTip
source: Lock/unlock this entity
es: Bloquear/desbloquear esta entidad
fr: Verrouiller/Déverrouiller cette entité

# ToolTip
source: (Hold Ctrl to apply to child entities recursively)
es: (Mantenga Ctrl para aplicar al niño entidades recursivamente)
fr: (Maintenez Ctrl pour appliquer à toutes les entités filles récursivement)

# ToolTip
source: Lock/unlock all entities
es: Bloqueo/desbloqueo de todas las entidades
fr: Verrouiller/Déverrouiller toutes les entités

# ToolTip
source: (Hold Ctrl to apply to child scenes recursively)
es: (Mantenga Ctrl para aplicar al niño escenas recursivamente)
fr: (Maintenez Ctrl pour appliquer à toutes les scènes filles récursivement)

# ToolTip
source: Load/unload all entities
es: Cargar/descargar todas las entidades
fr: Charger/Décharger toutes les entités

source: (Unloaded)
es: (Descargado)
fr: (Déchargé)

# ToolTip
source: Light probes and cubemaps...
es: Sondas de luz y cubemaps....
fr: Sources de lumière et patrons…

source: Light probes
es: Sondas de luz
fr: Sources de lumière

source: Bounces:
es: Rebotes:
fr: Rebonds :

# ToolTip
source: Compute lighting using light probes
es: Calcular la iluminación con sondas de luz
fr: Calculer l'éclairage à l'aide des sources lumineuses

# ToolTip
source: Reset light probes
es: Reiniciar las sondas de luz
fr: Réinitialiser les sources de lumière

source: Reset
es: Reiniciar
fr: Réinitialiser

# ToolTip
source: Generate a cubemap from the scene view and save as a texture
es: Generar un cubemap desde la vista de escena y guardar como una textura
fr: Génère un patron à partir de la scène et l'enregistre comme texture

source: Capture
es: capturar

# ToolTip
source: Navigation visibility...
es: Visibilidad de navegación...
fr: Visibilité de la navigation…

source: Show navigation meshes:
es: Ver Mallas de navegación:
fr: Afficher les maillages de navigation :

# Button
source: All
es: todo
fr: Tout

# Button
source: None
es: Ninguno
fr: Aucun

# ToolTip
source: Grid and gizmo options...
es: Opciones de cuadrícula y gizmo...
fr: Grille et options des gadgets…

source: Transformation gizmo size:
es: Tamaño del gizmo de transformación:
fr: Taille du gadget de transformation :

source: Component gizmo size:
es: Tamaño del gizmo de componente:
fr: Taille du gadget du composant :

# Button
source: Fixed
es: Fijar
fr: Fixe

# Button
source: Camera preview
es: Vista previa de la cámara
fr: Aperçu de la caméra

# Button
source: Light probe volumes
es: Volúmenes de luz de la sonda
fr: Volumes de source lumineuse

# Button
source: Other entities
es: Otras entidades
fr: Autres entités

# ToolTip
source: Editor camera options...
es: Opciones de la cámara del editor...
fr: Options de caméra de l'éditeur…

source: Projection
es: Proyección

# Button
source: Perspective
es: Perspectiva

# Button
source: Orthographic
es: Ortográfico
fr: Orthographique

source: Near plane:
es: Plano de cerca:

source: Far plane:
es: Plano lejano:

source: Field of view:
es: Campo de visión:
fr: Champ de vision :

source: Orthographic size:
es: Tamaño ortográfica:
fr: Taille orthographique :

source: Movement
es: Movimiento
fr: Mouvement

source: Speed:
es: Velocidad:
fr: Vitesse :

source: Orientation
es: Orientación
fr: Otrientation

# Button
source: Front
es: Delante
fr: Avant

# Button
source: Back
es: Atrás
fr: Arrière

# Button
source: Top
es: Arriba
fr: Dessus

# Button
source: Bottom
es: Abajo
fr: Dessous

# Button
source: Left
es: Izquierda
fr: Gauche

# Button
source: Right
es: Derecha
fr: Droite

# ToolTip
source: Snap translations to this value
es: Ajustar las transformaciones a este valor
fr: Aligner les translations sur cette valeur

# ToolTip
source: Snap rotations to this value
es: Ajustar las rotaciones a este valor
fr: Aligner les rotations sur cette valeur

# ToolTip
source: Snap scale to this factor
es: Ajustar la escala a este factor
fr: Aligner la mise à l'échelle à ce facteur

# ToolTip
source: Toggle material selection (click a selected asset to select its material)
es: Alternar la selección de materiales (haga clic en un asset seleccionado para elegir su material)
fr: Basculer la sélection des matériaux (cliquez sur une ressource sélectionnée pour sélectionner son matériau)

# ToolTip
source: Show or hide selection mask
es: Mostrar u ocultar la máscara de selección
fr: Afficher ou masquer le masque de sélection

source: Loading assets...
es: Cargando assets....
fr: Chargement des ressources…

# Menu
source: Open in prefab editor
es: Abrir en el editor de prefabs
fr: Ouvrir dans l'éditeur de prefab

source: Before you resume, fix the failing asset (likely a graphics compositor or scene).
es: Antes de reanudar, arregle el asset defectuoso (probablemente un compositor gráfico o una escena).
fr: Avant de continuer, corrigez la ressource défaillante (probablement un compositeur graphique ou une scène).

# Button
source: Resume
es: Reanudar
fr: Continuer

# Button
source: Copy error to clipboard
es: Error de copia en el portapapeles
fr: Copier l'erreur dans le presse-papiers

source: Select an entity
es: Seleccionar una entidad
fr: Sélectionner une entité

# ToolTip
source: Select the selected assets
es: Seleccionar los assets escogidos
fr: Sélectionner les ressources sélectionnées

# ToolTip
source: Cancel (Esc)
es: Cancelar (Esc)
fr: Annuler (Échap)

source: Select an entity:
es: Seleccione una entidad:
fr: Sélectionner une entité :

source: (Index: {0})
es: (Índice: {0})

# Menu
source: Action
es: Acción

# Menu
source: Delete selection
es: Eliminar selección
fr: Supprimer la sélection

source: Render stages:
es: Etapas de renderizado:
fr: Étapes de rendu :

source: Render features:
es: Características de renderizado:
fr: Fonctions de rendu :

source: Camera slots:
es: Ranuras de la cámara:
fr: Emplacements de caméra :

# ToolTip
source: Toggle between find and replace modes
es: Alternar entre los modos Buscar y Reemplazar
fr: Basculer entre le mode rechercher et remplacer

# ToolTip
source: Replace next (Alt+R)
es: Reemplazar siguiente (Alt + R)
fr: Remplacer le suivant (Alt + R)

# ToolTip
source: Replace all (Alt+A)
es: Reemplazar todos (Alt + A)
fr: Remplacer tout (Alt + A)

source: No suggestions
es: No hay sugerencias
fr: Aucune suggestion

# Button
source: Sprite sheet properties
es: Propiedades de la hoja de sprites
fr: Propriétés de la feuille de sprite

source: Sheet type:
es: Tipo de hoja:
fr: Type de feuille :

# Button
source: Use color key
es: Usar clave de color
fr: Utiliser la clé de couleur

# ToolTip
source: If enabled, the sprite uses the given color as transparency
es: Si está habilitado, el sprite utiliza el color determinado como transparencia
fr: Si activé, le sprite utilise la couleur donnée comme de la transparence

# ToolTip
source: To select the color key, select a pixel color from the image
es: Para seleccionar la clave de color, seleccione un color del pixel de la imagen
fr: Pour sélectionner la clé de couleur, sélectionnez une couleur de pixel dans l'image

# ToolTip
source: Add a new empty sprite
es: Añadir un nuevo sprite vacío
fr: Ajouter un nouveau sprite vierge

# ToolTip
source: Duplicate selected sprites
es: Duplicar sprites seleccionados
fr: Dupliquer les sprites sélectionnés

# ToolTip
source: Delete selected sprites
es: Eliminar sprites seleccionados
fr: Supprimer les sprites sélectionnés

# ToolTip
source: Move selected sprites up
es: Mover hacia arriba los sprites seleccionados
fr: Déplacer les sprites sélectionnés vers le haut

# ToolTip
source: Move selected sprites down
es: Mover hacia abajo los sprites seleccionados
fr: Déplacer les sprites sélectionnés vers le bas

# Menu
source: Add new sprite
es: Añadir nuevo sprite
fr: Ajouter un nouveau sprite

# Menu
source: Duplicate sprite
es: Duplicar sprite
fr: Dupliquer le sprite

# Menu
source: Edit image
es: Editar imagen
fr: Modifier l'image

# Menu
source: Show image in explorer
es: Mostrar imagen en el explorador de archivos
fr: Afficher l'image dans l'explorateur

source: Select a single image from the left panel
es: Seleccione una única imagen del panel izquierdo
fr: Sélectionnez une seule image depuis le panneau de gauche

# ToolTip
source: Select previous sprite
es: Seleccione el sprite anterior
fr: Sélectionner le sprite précédent

# ToolTip
source: Select next sprite
es: Seleccione el siguiente sprite
fr: Sélectionner le sprite suivant

# ToolTip
source: Zoom out
es: Zoom de alejamiento
fr: Zoom arrière

# ToolTip
source: Zoom in
es: Zoom
fr: Zoom avant

# ToolTip
source: Scale to real pixel size
es: Escalar hasta tamaño de píxel real
fr: Mettre à l'échelle à la taille réelle des pixels

# ToolTip
source: Fit image to screen
es: Ajustar la imagen a la pantalla
fr: Ajuster l'image à l'écran

# ToolTip
source: Center view on current sprite region
es: Centrar la vista en la región actual del sprite
fr: Centrer la vue sur la région du sprite courant

# ToolTip
source: Change selection rectangle color
es: Cambiar el color del rectángulo de selección
fr: Modifier la couleur du rectangle de sélection

# ToolTip
source: Highlight the current selection
es: Resaltar la selección actual
fr: Mettre en surbrillance la sélection actuelle

# ToolTip
source: Select entire image
es: Seleccionar toda la imagen
fr: Sélectionner l'image entière

# ToolTip
source: Select the sprite region using the magic wand
es: Seleccionar la región del sprite con la varita mágica
fr: Sélectionner la région du sprite à l'aide de la baguette magique

# Button
source: Use transparency
es: Usar transparencia
fr: Utiliser la transparence

# ToolTip
source: Move the sprite center
es: Mover el centro del sprite
fr: Déplacer le centre du sprite

# ToolTip
source: Resize the sprite borders
es: Redimensionar los bordes del sprite
fr: Redimensionner les bordures du sprite

# ToolTip
source: Unlock the sprite borders
es: Desbloquear los bordes del sprite
fr: Déverrouiller les bordures du sprite

# ToolTip
source: Lock the sprite borders
es: Bloquear los bordes del sprite
fr: Verrouiller les bordures du sprite

# Menu
source: Group into
es: Agrupar en
fr: Grouper en

# Menu
source: Ungroup
es: Desagrupar
fr: Dégrouper

# Menu
source: Change layout type
es: Cambiar el tipo de layout
fr: Modifier le type de disposition

# Menu
source: Pin origin
es: Origen de alfiler
fr: Épingler l'origine

# Menu
source: Top left
es: Arriba a la izquierda
fr: En haut à gauche

# Menu
source: Top
es: Arriba
fr: En haut

# Menu
source: Top right
es: Arriba a la derecha
fr: En haut à droite

# Menu
source: Left
es: Izquierda
fr: À gauche

# Menu
source: Center
es: Centro
fr: Au centre

# Menu
source: Right
es: Derecha
fr: À droite

# Menu
source: Bottom left
es: Abajo a la izquierda
fr: En bas à gauche

# Menu
source: Bottom
es: Abajo
fr: En bas

# Menu
source: Bottom right
es: Abajo a la derecha
fr: En bas à droite

# Menu
source: Front
es: Delante
fr: À l'avant

# Menu
source: Middle
es: En medio
fr: Au milieu

# Menu
source: Back
es: Atrás
fr: À l'arrière

# Menu
source: Row
es: Fila
fr: Ligne

# Menu
source: Move up
es: Mover hacia arriba
fr: Déplacer vers le haut

# Menu
source: Move down
es: Mover hacia abajo
fr: Déplacer vers le bas

# Menu
source: Column
es: Columna
fr: Colonne

# Menu
source: Move left
es: Mover hacia la izquierda
fr: Déplacer vers la gauche

# Menu
source: Move right
es: Mover hacia la derecha
fr: Déplacer vers la droite

# Menu
source: Layer
es: Capa
fr: Couche

# Menu
source: Move back
es: Mover hacia atrás
fr: Déplacer vers l'arrière

# Menu
source: Move front
es: Mover al frente
fr: Déplacer vers l'avant

# Menu
source: Open library in editor
es: Abrir biblioteca en el editor
fr: Ouvrir la bibliothèque dans l'éditeur

# Menu
source: Select library in asset view
es: Seleccionar biblioteca en la vista de assets
fr: Sélectionner une bibliothèque dans la vue des ressources

# Menu
source: Break link to library
es: Romper el vínculo a la biblioteca
fr: Rompre le lien vers la bibliothèque

# Menu
source: Create page from selection
es: Crear página a partir de la selección
fr: Créer une page à partir de la sélection

# Menu
source: Create library from selection
es: Crear biblioteca a partir de la selección
fr: Créer une bibliothèque à partir de la sélection

# Menu
source: View
es: Ver
fr: Vue

# Menu
source: Zoom in
es: Zoom
fr: Zoom avant

# Menu
source: Zoom out
es: Zoom de alejamiento
fr: Zoom arrière

# Menu
source: Reset camera
es: Reiniciar la cámara
fr: Réinitialiser la caméra

# Button
source: UI properties
es: Propiedades de la interfaz de usuario
fr: Propriétés de l'interface
