Repository: stride3d/stride
Catalog: sources/localization/*/Xenko.Assets.Presentation.*.po
Languages: es, fr

source: UI library
es: Biblioteca de interfaz de usuario
fr: Bibliothèque de l'interface

# ToolTip
source: Expand all elements
es: Expandir todos los elementos
fr: Étendre tous les éléments

# ToolTip
source: Collapse all elements
es: Contraer todos los elementos
fr: Réduire tous les éléments

# ToolTip
source: Reset zoom
es: Reiniciar ampliación
fr: Réinitialiser le niveau de zoom

# ToolTip
source: Snaps to this value (0 to disable)
es: Se ajusta a este valor (0 para desactivarlo)
fr: Aligner à cette valeur (0 pour désactiver)

source: Colors
es: Colores
fr: Couleurs

source: Guideline
es: Directriz
fr: Lignes directrices

source: Highlight
es: Resalte
fr: Surbrillance

source: Selection
es: Selección
fr: Sélection

source: Sizing
es: Dimensionamiento
fr: Dimensionnement

source: Before you resume, fix the failing asset (likely a UI page or UI library).
es: Antes de reanudar, arregle el asset defectuoso (probablemente una página o biblioteca de interfaz de usuario).
fr: Avant de continuer, corrigez la ressource défaillante (probablement une page ou une bibliothèque de l'interface).

# Menu
source: Set
es: Establecer
fr: Définir

source: Functions:
es: Funciones:
fr: Fonctions :

# Button
source: Static method
es: Método estático
fr: Méthode statique

source: Return type...
es: Tipo de valor devuelto...
fr: Type de retour…

source: Function parameters:
es: Parámetros de la función:
fr: Paramètres de la fonction :

# ToolTip
source: Remove the selected curve
es: Quitar la curva seleccionada
fr: Supprimer la courbe sélectionner

source: Curves:
es: Curvas:
fr: Courbes :

# ToolTip
source: Show or hide the tracker
es: Mostrar u ocultar el tracker
fr: Afficher ou masquer la barre de progression

# ToolTip
source: Fit view to curve
es: Ajustar la vista de la curva
fr: Ajuster la vue à la courbe

# ToolTip
source: Fit view to curve height
es: Ajustar la vista a la altura de la curva
fr: Ajuster la vue à la hauteur de courbe

# ToolTip
source: Fit view to curve width
es: Ajustar la vista a la anchura de la curva
fr: Ajuster la vue à la largeur de courbe

# ToolTip
source: Delete selected points
es: Eliminar puntos seleccionados
fr: Supprimer les points sélectionnés

# ToolTip
source: First key
es: Primera clave
fr: Première clé

# ToolTip
source: Previous key
es: Clave anterior
fr: Clé précédente

# ToolTip
source: Next key
es: Siguiente clave
fr: Clé suivante

# ToolTip
source: Last key
es: Última clave
fr: Dernière clé

source: Key
es: Clave
fr: Clé

source: Value
es: Valor
fr: Valeur

# Menu
source: Curve
es: Curva
fr: Courbe

# Menu
source: Add point
es: Agregar punto
fr: Ajouter un point

# Menu
source: Delete selected points
es: Eliminar puntos seleccionados
fr: Supprimer les points sélectionnés

# Menu
source: Clear whole curve
es: Borrar toda la curva
fr: Effacer toute la courbe

# Menu
source: Fit to curve
es: Ajustar a la curva
fr: Ajuster à la courbe

# Menu
source: Fit to curve height
es: Ajuste a la altura de la curva
fr: Ajuster à la hauteur de la courbe

# Menu
source: Fit to curve width
es: Ajuste a la anchura de la curva
fr: Ajuster à la largeur de la courbe

source: Create a game...
es: Crear un juego...
fr: Créer un jeu…

source: Platforms
es: Plataformas
fr: Plateformes

source: This machine doesn't meet the requirements to build for this platform.
es: Esta máquina no cumple los requisitos para esta plataforma.
fr: Cette machine ne répond pas aux exigences pour compiler pour cette plateforme.

source: Asset packs
es: Paquetes de assets
fr: Packs de ressource

source: Rendering
es: Renderizado
fr: Rendu

# Button
source: High dynamic range (HDR)
es: Alto rango dinámico (HDR)

# Button
source: Low dynamic range (LDR)
es: Bajo rango dinámico (LDR)

# Button
source: OK
es: De acuerdo

source: Import from model
es: Importar desde un modelo
fr: Importer depuis un modèle

source: Materials and textures
es: Materiales y texturas
fr: Matériaux et textures

# Button
source: Import materials
es: Importar materiales
fr: Importer des matériaux

# Button
source: Import textures
es: Importar texturas
fr: Importer des textures

source: Skeleton
es: Esqueleto
fr: Squelette

# Button
source: Import skeleton
es: Importar esqueleto
fr: Importer un squelette

# Button
source: No skeleton
es: Sin esqueleto
fr: Pas de squelette

# Button
source: Use another skeleton for this model:
es: Utilice otro esqueleto para este modelo:
fr: Utiliser un autre squelette pour ce modèle :

source: New code library
es: Nueva biblioteca de código
fr: Nouvelle bibliothèque de code

source: Library name:
es: Nombre de la biblioteca:
fr: Nom de la bibliothèque :

source: New script
es: Nuevo script
fr: Nouveau script

# Button
source: Create script
es: Crear script
fr: Créer un script

source: Class:
es: Clase:
fr: Classe :

source: Select platforms
es: Seleccionar plataformas
fr: Sélectionner les plateformes

source: (This will remove the project from the package and disk.)
es: (Esto eliminará el proyecto del paquete y el disco.)
fr: (Cela supprimera le projet du paquet et du disque.)

# Button
source: Force regeneration of all platform projects
es: Forzar regeneración de todas las plataformas de proyectos
fr: Forcer la régénération de tous les projets de la plateforme

# ToolTip
source: Play the animation
es: Jugar la animación
fr: Lire l'animation

# ToolTip
source: Pause the animation
es: Pausar la animación
fr: Mettre l'animation en pause

source: Time scale:
es: Escala de tiempo:
fr: Échelle de temps :

# ToolTip
source: Reset the camera
es: Reiniciar la cámara
fr: Réinitialiser la caméra

source: Scenes can't be previewed. To see the scene, open it in the scene editor.
es: Las escenas no se pueden previsualizar. Para ver la escena, ábrala en el editor de escenas.
fr: Les scènes ne peuvent pas être prévisualisées. Pour voir la scène, ouvrez-la dans l'éditeur de scène.

# ToolTip
source: Play the sound
es: Reproducir el sonido
fr: Lire le son

# ToolTip
source: Pause the sound
es: Pausar el sonido
fr: Mettre le son en pause

source: Building preview sound asset...
es: Creación de una vista previa de sonido....
fr: Construction de la ressource de prévisualisation du son…

# ToolTip
source: Previous sprite
es: Sprite anterior
fr: Sprite précédent

# ToolTip
source: Next sprite
es: Siguiente sprite
fr: Sprite suivant

source: Preview text
es: Vista previa del texto
fr: Prévisualiser le texte

# ToolTip
source: Previous slice
es: Segmento anterior
fr: Tranche précédente

# ToolTip
source: Next slice
es: Siguiente segmento
fr: Tranche suivante

# ToolTip
source: Edit curve
es: Tratar curva
fr: Modifier la courbe

source: (Different values)
es: (Valores diferentes)
fr: (Valeurs différentes)

# Button
source: Refresh
es: Actualizar
fr: Actualiser

source: Live scripting debugger
es: Depurador de scripts en vivo
fr: Débogueur de script en temps réel

# ToolTip
source: Select these assets
es: Seleccione estos assets
fr: Sélectionner ces ressources

# ToolTip
source: Select an asset
es: Seleccione un asset
fr: Sélectionner une ressource

# ToolTip
source: Clear the reference
es: Limpiar la referencia
fr: Effacer la référence

# ToolTip
source: Select the referenced asset
es: Seleccione el asset que se hace referencia
fr: Sélectionner la ressource référencée

source: Add component
es: Añadir componente
fr: Ajouter un composant

# ToolTip
source: Highlight this material in the scene editor
es: Resaltar este material en el editor de escena
fr: Mettre ce matériau en surbrillance dans l'éditeur de scène

source: Select shader...
es: Seleccionar el shader.
fr: Sélectionner le shader…

source: Cubemap
fr: Patron

# Menu
source: Layout
fr: Disposition

# Menu
source: Get
fr: Obtenir

source: W: {0}
fr: L : {0}
